NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54l15/nrf54l15_types.h
/* RESOLVED @Bit 1 : Write '1' to enable interrupt for event RESOLVED */
  #define AAR_INTENSET_RESOLVED_Pos (1UL)            /*!< Position of RESOLVED field.                                          */
  #define AAR_INTENSET_RESOLVED_Msk (0x1UL << AAR_INTENSET_RESOLVED_Pos) /*!< Bit mask of RESOLVED field.                      */
  #define AAR_INTENSET_RESOLVED_Min (0x0UL)          /*!< Min enumerator value of RESOLVED field.                              */
  #define AAR_INTENSET_RESOLVED_Max (0x1UL)          /*!< Max enumerator value of RESOLVED field.                              */
  #define AAR_INTENSET_RESOLVED_Set (0x1UL)          /*!< Enable                                                               */
  #define AAR_INTENSET_RESOLVED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define AAR_INTENSET_RESOLVED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* NOTRESOLVED @Bit 2 : Write '1' to enable interrupt for event NOTRESOLVED */
  #define AAR_INTENSET_NOTRESOLVED_Pos (2UL)         /*!< Position of NOTRESOLVED field.                                       */
  #define AAR_INTENSET_NOTRESOLVED_Msk (0x1UL << AAR_INTENSET_NOTRESOLVED_Pos) /*!< Bit mask of NOTRESOLVED field.             */
  #define AAR_INTENSET_NOTRESOLVED_Min (0x0UL)       /*!< Min enumerator value of NOTRESOLVED field.                           */
  #define AAR_INTENSET_NOTRESOLVED_Max (0x1UL)       /*!< Max enumerator value of NOTRESOLVED field.                           */
  #define AAR_INTENSET_NOTRESOLVED_Set (0x1UL)       /*!< Enable                                                               */
  #define AAR_INTENSET_NOTRESOLVED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define AAR_INTENSET_NOTRESOLVED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* ERROR @Bit 3 : Write '1' to enable interrupt for event ERROR */
  #define AAR_INTENSET_ERROR_Pos (3UL)               /*!< Position of ERROR field.                                             */
  #define AAR_INTENSET_ERROR_Msk (0x1UL << AAR_INTENSET_ERROR_Pos) /*!< Bit mask of ERROR field.                               */
  #define AAR_INTENSET_ERROR_Min (0x0UL)             /*!< Min enumerator value of ERROR field.                                 */
  #define AAR_INTENSET_ERROR_Max (0x1UL)             /*!< Max enumerator value of ERROR field.                                 */
  #define AAR_INTENSET_ERROR_Set (0x1UL)             /*!< Enable                                                               */
  #define AAR_INTENSET_ERROR_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define AAR_INTENSET_ERROR_Enabled (0x1UL)         /*!< Read: Enabled                                                        */


/* AAR_INTENCLR: Disable interrupt */
  #define AAR_INTENCLR_ResetValue (0x00000000UL)     /*!< Reset value of INTENCLR register.                                    */

/* END @Bit 0 : Write '1' to disable interrupt for event END */
  #define AAR_INTENCLR_END_Pos (0UL)                 /*!< Position of END field.                                               */
  #define AAR_INTENCLR_END_Msk (0x1UL << AAR_INTENCLR_END_Pos) /*!< Bit mask of END field.                                     */
  #define AAR_INTENCLR_END_Min (0x0UL)               /*!< Min enumerator value of END field.                                   */
  #define AAR_INTENCLR_END_Max (0x1UL)               /*!< Max enumerator value of END field.                                   */
  #define AAR_INTENCLR_END_Clear (0x1UL)             /*!< Disable                                                              */
  #define AAR_INTENCLR_END_Disabled (0x0UL)          /*!< Read: Disabled                                                       */
  #define AAR_INTENCLR_END_Enabled (0x1UL)           /*!< Read: Enabled                                                        */

/* RESOLVED @Bit 1 : Write '1' to disable interrupt for event RESOLVED */
  #define AAR_INTENCLR_RESOLVED_Pos (1UL)            /*!< Position of RESOLVED field.                                          */
  #define AAR_INTENCLR_RESOLVED_Msk (0x1UL << AAR_INTENCLR_RESOLVED_Pos) /*!< Bit mask of RESOLVED field.                      */
  #define AAR_INTENCLR_RESOLVED_Min (0x0UL)          /*!< Min enumerator value of RESOLVED field.                              */
  #define AAR_INTENCLR_RESOLVED_Max (0x1UL)          /*!< Max enumerator value of RESOLVED field.                              */
  #define AAR_INTENCLR_RESOLVED_Clear (0x1UL)        /*!< Disable                                                              */
  #define AAR_INTENCLR_RESOLVED_Disabled (0x0UL)     /*!< Read: Disabled                                                       */
  #define AAR_INTENCLR_RESOLVED_Enabled (0x1UL)      /*!< Read: Enabled                                                        */

/* NOTRESOLVED @Bit 2 : Write '1' to disable interrupt for event NOTRESOLVED */
  #define AAR_INTENCLR_NOTRESOLVED_Pos (2UL)         /*!< Position of NOTRESOLVED field.                                       */
  #define AAR_INTENCLR_NOTRESOLVED_Msk (0x1UL << AAR_INTENCLR_NOTRESOLVED_Pos) /*!< Bit mask of NOTRESOLVED field.             */
  #define AAR_INTENCLR_NOTRESOLVED_Min (0x0UL)       /*!< Min enumerator value of NOTRESOLVED field.                           */
  #define AAR_INTENCLR_NOTRESOLVED_Max (0x1UL)       /*!< Max enumerator value of NOTRESOLVED field.                           */
  #define AAR_INTENCLR_NOTRESOLVED_Clear (0x1UL)     /*!< Disable                                                              */
  #define AAR_INTENCLR_NOTRESOLVED_Disabled (0x0UL)  /*!< Read: Disabled                                                       */
  #define AAR_INTENCLR_NOTRESOLVED_Enabled (0x1UL)   /*!< Read: Enabled                                                        */

/* ERROR @Bit 3 : Write '1' to disable interrupt for event ERROR */
  #define AAR_INTENCLR_ERROR_Pos (3UL)               /*!< Position of ERROR field.                                             */
  #define AAR_INTENCLR_ERROR_Msk (0x1UL << AAR_INTENCLR_ERROR_Pos) /*!< Bit mask of ERROR field.                               */
  #define AAR_INTENCLR_ERROR_Min (0x0UL)             /*!< Min enumerator value of ERROR field.                                 */
  #define AAR_INTENCLR_ERROR_Max (0x1UL)             /*!< Max enumerator value of ERROR field.                                 */
  #define AAR_INTENCLR_ERROR_Clear (0x1UL)           /*!< Disable                                                              */
  #define AAR_INTENCLR_ERROR_Disabled (0x0UL)        /*!< Read: Disabled                                                       */
  #define AAR_INTENCLR_ERROR_Enabled (0x1UL)         /*!< Read: Enabled                                                        */


/* AAR_ERRORSTATUS: Error status */
  #define AAR_ERRORSTATUS_ResetValue (0x00000000UL)  /*!< Reset value of ERRORSTATUS register.                                 */

/* ERRORSTATUS @Bits 0..2 : Error status when the ERROR event is generated */
  #define AAR_ERRORSTATUS_ERRORSTATUS_Pos (0UL)      /*!< Position of ERRORSTATUS field.                                       */
  #define AAR_ERRORSTATUS_ERRORSTATUS_Msk (0x7UL << AAR_ERRORSTATUS_ERRORSTATUS_Pos) /*!< Bit mask of ERRORSTATUS field.       */
  #define AAR_ERRORSTATUS_ERRORSTATUS_Min (0x0UL)    /*!< Min enumerator value of ERRORSTATUS field.                           */
  #define AAR_ERRORSTATUS_ERRORSTATUS_Max (0x4UL)    /*!< Max enumerator value of ERRORSTATUS field.                           */
  #define AAR_ERRORSTATUS_ERRORSTATUS_NoError (0x0UL) /*!< No errors have occurred                                             */
  #define AAR_ERRORSTATUS_ERRORSTATUS_PrematureInptrEnd (0x1UL) /*!< End of INPTR job list before data structure was read.     */
  #define AAR_ERRORSTATUS_ERRORSTATUS_DmaError (0x4UL) /*!< Bus error during DMA access.                                       */


/* AAR_ENABLE: Enable AAR */
  #define AAR_ENABLE_ResetValue (0x00000000UL)       /*!< Reset value of ENABLE register.                                      */

