NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54l15/nrf54l15_types.h
/* PORT @Bits 8..11 : GPIO Port selection */
  #define COMP_PSEL_PORT_Pos (8UL)                   /*!< Position of PORT field.                                              */
  #define COMP_PSEL_PORT_Msk (0xFUL << COMP_PSEL_PORT_Pos) /*!< Bit mask of PORT field.                                        */


/* COMP_REFSEL: Reference source select for single-ended mode */
  #define COMP_REFSEL_ResetValue (0x00000004UL)      /*!< Reset value of REFSEL register.                                      */

/* REFSEL @Bits 0..2 : Reference select */
  #define COMP_REFSEL_REFSEL_Pos (0UL)               /*!< Position of REFSEL field.                                            */
  #define COMP_REFSEL_REFSEL_Msk (0x7UL << COMP_REFSEL_REFSEL_Pos) /*!< Bit mask of REFSEL field.                              */
  #define COMP_REFSEL_REFSEL_Min (0x0UL)             /*!< Min enumerator value of REFSEL field.                                */
  #define COMP_REFSEL_REFSEL_Max (0x5UL)             /*!< Max enumerator value of REFSEL field.                                */
  #define COMP_REFSEL_REFSEL_Int1V2 (0x0UL)          /*!< VREF = internal 1.2 V reference                                      */
  #define COMP_REFSEL_REFSEL_VDD (0x4UL)             /*!< VREF = VDD                                                           */
  #define COMP_REFSEL_REFSEL_ARef (0x5UL)            /*!< VREF = AREF                                                          */


/* COMP_EXTREFSEL: External reference select */
  #define COMP_EXTREFSEL_ResetValue (0x00000000UL)   /*!< Reset value of EXTREFSEL register.                                   */

/* PIN @Bits 0..4 : External analog reference pin select */
  #define COMP_EXTREFSEL_PIN_Pos (0UL)               /*!< Position of PIN field.                                               */
  #define COMP_EXTREFSEL_PIN_Msk (0x1FUL << COMP_EXTREFSEL_PIN_Pos) /*!< Bit mask of PIN field.                                */

/* PORT @Bits 8..11 : GPIO Port selection */
  #define COMP_EXTREFSEL_PORT_Pos (8UL)              /*!< Position of PORT field.                                              */
  #define COMP_EXTREFSEL_PORT_Msk (0xFUL << COMP_EXTREFSEL_PORT_Pos) /*!< Bit mask of PORT field.                              */


/* COMP_TH: Threshold configuration for hysteresis unit */
  #define COMP_TH_ResetValue (0x00002020UL)          /*!< Reset value of TH register.                                          */

/* THDOWN @Bits 0..5 : VDOWN = (THDOWN+1)/64*VREF */
  #define COMP_TH_THDOWN_Pos (0UL)                   /*!< Position of THDOWN field.                                            */
  #define COMP_TH_THDOWN_Msk (0x3FUL << COMP_TH_THDOWN_Pos) /*!< Bit mask of THDOWN field.                                     */
  #define COMP_TH_THDOWN_Min (0x00UL)                /*!< Min value of THDOWN field.                                           */
  #define COMP_TH_THDOWN_Max (0x3FUL)                /*!< Max size of THDOWN field.                                            */

/* THUP @Bits 8..13 : VUP = (THUP+1)/64*VREF */
  #define COMP_TH_THUP_Pos (8UL)                     /*!< Position of THUP field.                                              */
  #define COMP_TH_THUP_Msk (0x3FUL << COMP_TH_THUP_Pos) /*!< Bit mask of THUP field.                                           */
  #define COMP_TH_THUP_Min (0x00UL)                  /*!< Min value of THUP field.                                             */
  #define COMP_TH_THUP_Max (0x3FUL)                  /*!< Max size of THUP field.                                              */


/* COMP_MODE: Mode configuration */
  #define COMP_MODE_ResetValue (0x00000000UL)        /*!< Reset value of MODE register.                                        */

/* SP @Bits 0..1 : Speed and power modes */
  #define COMP_MODE_SP_Pos (0UL)                     /*!< Position of SP field.                                                */
  #define COMP_MODE_SP_Msk (0x3UL << COMP_MODE_SP_Pos) /*!< Bit mask of SP field.                                              */
  #define COMP_MODE_SP_Min (0x0UL)                   /*!< Min enumerator value of SP field.                                    */
  #define COMP_MODE_SP_Max (0x2UL)                   /*!< Max enumerator value of SP field.                                    */
  #define COMP_MODE_SP_Low (0x0UL)                   /*!< Low-power mode                                                       */
  #define COMP_MODE_SP_Normal (0x1UL)                /*!< Normal mode                                                          */
  #define COMP_MODE_SP_High (0x2UL)                  /*!< High-speed mode                                                      */

/* MAIN @Bit 8 : Main operation modes */
  #define COMP_MODE_MAIN_Pos (8UL)                   /*!< Position of MAIN field.                                              */
  #define COMP_MODE_MAIN_Msk (0x1UL << COMP_MODE_MAIN_Pos) /*!< Bit mask of MAIN field.                                        */
  #define COMP_MODE_MAIN_Min (0x0UL)                 /*!< Min enumerator value of MAIN field.                                  */
  #define COMP_MODE_MAIN_Max (0x1UL)                 /*!< Max enumerator value of MAIN field.                                  */
  #define COMP_MODE_MAIN_SE (0x0UL)                  /*!< Single-ended mode                                                    */
  #define COMP_MODE_MAIN_Diff (0x1UL)                /*!< Differential mode                                                    */


/* COMP_HYST: Comparator hysteresis enable */
  #define COMP_HYST_ResetValue (0x00000000UL)        /*!< Reset value of HYST register.                                        */

/* HYST @Bit 0 : Comparator hysteresis */
  #define COMP_HYST_HYST_Pos (0UL)                   /*!< Position of HYST field.                                              */
  #define COMP_HYST_HYST_Msk (0x1UL << COMP_HYST_HYST_Pos) /*!< Bit mask of HYST field.                                        */
  #define COMP_HYST_HYST_Min (0x0UL)                 /*!< Min enumerator value of HYST field.                                  */
  #define COMP_HYST_HYST_Max (0x1UL)                 /*!< Max enumerator value of HYST field.                                  */
  #define COMP_HYST_HYST_NoHyst (0x0UL)              /*!< Comparator hysteresis disabled                                       */
  #define COMP_HYST_HYST_Hyst40mV (0x1UL)            /*!< Comparator hysteresis enabled                                        */


/* COMP_ISOURCE: Current source select on analog input */
  #define COMP_ISOURCE_ResetValue (0x00000000UL)     /*!< Reset value of ISOURCE register.                                     */

/* ISOURCE @Bits 0..1 : Current source select on analog input */
  #define COMP_ISOURCE_ISOURCE_Pos (0UL)             /*!< Position of ISOURCE field.                                           */
  #define COMP_ISOURCE_ISOURCE_Msk (0x3UL << COMP_ISOURCE_ISOURCE_Pos) /*!< Bit mask of ISOURCE field.                         */
  #define COMP_ISOURCE_ISOURCE_Min (0x0UL)           /*!< Min enumerator value of ISOURCE field.                               */
  #define COMP_ISOURCE_ISOURCE_Max (0x3UL)           /*!< Max enumerator value of ISOURCE field.                               */
  #define COMP_ISOURCE_ISOURCE_Off (0x0UL)           /*!< Current source disabled                                              */
  #define COMP_ISOURCE_ISOURCE_Ien2uA5 (0x1UL)       /*!< Current source enabled (+/- 2.5 uA)                                  */
  #define COMP_ISOURCE_ISOURCE_Ien5uA (0x2UL)        /*!< Current source enabled (+/- 5 uA)                                    */
  #define COMP_ISOURCE_ISOURCE_Ien10uA (0x3UL)       /*!< Current source enabled (+/- 10 uA)                                   */


#endif                                               /*!< !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__)                    */

/* =========================================================================================================================== */
/* ================                                           CPUC                                           ================ */
/* =========================================================================================================================== */

#if !defined(__ASSEMBLER__) && !defined(__ASSEMBLY__) /*!< Ignore C structs for assembly code.                                 */
/* ======================================================= Struct CPUC ======================================================= */
/**
  * @brief CPU control
  */
  typedef struct {                                   /*!< CPUC Structure                                                       */
    __IM uint32_t RESERVED[64];
    __IOM uint32_t EVENTS_FPUIOC;                    /*!< (@ 0x00000100) An invalid operation exception has occurred in the
                                                                         FPU.*/
    __IOM uint32_t EVENTS_FPUDZC;                    /*!< (@ 0x00000104) A floating-point divide-by-zero exception has occurred
                                                                         in the FPU.*/
    __IOM uint32_t EVENTS_FPUOFC;                    /*!< (@ 0x00000108) A floating-point overflow exception has occurred in the
                                                                         FPU.*/
    __IOM uint32_t EVENTS_FPUUFC;                    /*!< (@ 0x0000010C) A floating-point underflow exception has occurred in
                                                                         the FPU.*/
    __IOM uint32_t EVENTS_FPUIXC;                    /*!< (@ 0x00000110) A floating-point inexact exception has occurred in the
                                                                         FPU.*/
    __IOM uint32_t EVENTS_FPUIDC;                    /*!< (@ 0x00000114) A floating-point input denormal exception has occurred
                                                                         in the FPU.*/
    __IM uint32_t RESERVED1[122];
    __IOM uint32_t INTEN;                            /*!< (@ 0x00000300) Enable or disable interrupt                           */
    __IOM uint32_t INTENSET;                         /*!< (@ 0x00000304) Enable interrupt                                      */
    __IOM uint32_t INTENCLR;                         /*!< (@ 0x00000308) Disable interrupt                                     */
    __IM uint32_t RESERVED2[125];
    __IOM uint32_t LOCK;                             /*!< (@ 0x00000500) Register to lock the certain parts of the CPU from
                                                                         being modified.*/
    __IM uint32_t CPUID;                             /*!< (@ 0x00000504) The identifier for the CPU in this subsystem.         */
  } NRF_CPUC_Type;                                   /*!< Size = 1288 (0x508)                                                  */

/* CPUC_EVENTS_FPUIOC: An invalid operation exception has occurred in the FPU. */
  #define CPUC_EVENTS_FPUIOC_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_FPUIOC register.                             */

/* EVENTS_FPUIOC @Bit 0 : An invalid operation exception has occurred in the FPU. */
  #define CPUC_EVENTS_FPUIOC_EVENTS_FPUIOC_Pos (0UL) /*!< Position of EVENTS_FPUIOC field.                                     */
  #define CPUC_EVENTS_FPUIOC_EVENTS_FPUIOC_Msk (0x1UL << CPUC_EVENTS_FPUIOC_EVENTS_FPUIOC_Pos) /*!< Bit mask of EVENTS_FPUIOC
                                                                            field.*/
  #define CPUC_EVENTS_FPUIOC_EVENTS_FPUIOC_Min (0x0UL) /*!< Min enumerator value of EVENTS_FPUIOC field.                       */
  #define CPUC_EVENTS_FPUIOC_EVENTS_FPUIOC_Max (0x1UL) /*!< Max enumerator value of EVENTS_FPUIOC field.                       */
  #define CPUC_EVENTS_FPUIOC_EVENTS_FPUIOC_NotGenerated (0x0UL) /*!< Event not generated                                       */
  #define CPUC_EVENTS_FPUIOC_EVENTS_FPUIOC_Generated (0x1UL) /*!< Event generated                                              */


/* CPUC_EVENTS_FPUDZC: A floating-point divide-by-zero exception has occurred in the FPU. */
  #define CPUC_EVENTS_FPUDZC_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_FPUDZC register.                             */

/* EVENTS_FPUDZC @Bit 0 : A floating-point divide-by-zero exception has occurred in the FPU. */
  #define CPUC_EVENTS_FPUDZC_EVENTS_FPUDZC_Pos (0UL) /*!< Position of EVENTS_FPUDZC field.                                     */
  #define CPUC_EVENTS_FPUDZC_EVENTS_FPUDZC_Msk (0x1UL << CPUC_EVENTS_FPUDZC_EVENTS_FPUDZC_Pos) /*!< Bit mask of EVENTS_FPUDZC
                                                                            field.*/
  #define CPUC_EVENTS_FPUDZC_EVENTS_FPUDZC_Min (0x0UL) /*!< Min enumerator value of EVENTS_FPUDZC field.                       */
  #define CPUC_EVENTS_FPUDZC_EVENTS_FPUDZC_Max (0x1UL) /*!< Max enumerator value of EVENTS_FPUDZC field.                       */
  #define CPUC_EVENTS_FPUDZC_EVENTS_FPUDZC_NotGenerated (0x0UL) /*!< Event not generated                                       */
  #define CPUC_EVENTS_FPUDZC_EVENTS_FPUDZC_Generated (0x1UL) /*!< Event generated                                              */


/* CPUC_EVENTS_FPUOFC: A floating-point overflow exception has occurred in the FPU. */
  #define CPUC_EVENTS_FPUOFC_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_FPUOFC register.                             */

