NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54l15/nrf54l15_types.h
  #define CRACENCORE_RNGCONTROL_CONTROL_LFSREN_Pos (1UL) /*!< Position of LFSREN field.                                        */
  #define CRACENCORE_RNGCONTROL_CONTROL_LFSREN_Msk (0x1UL << CRACENCORE_RNGCONTROL_CONTROL_LFSREN_Pos) /*!< Bit mask of LFSREN
                                                                            field.*/

/* TESTEN @Bit 2 : Select input for conditioning function and continuous tests: */
  #define CRACENCORE_RNGCONTROL_CONTROL_TESTEN_Pos (2UL) /*!< Position of TESTEN field.                                        */
  #define CRACENCORE_RNGCONTROL_CONTROL_TESTEN_Msk (0x1UL << CRACENCORE_RNGCONTROL_CONTROL_TESTEN_Pos) /*!< Bit mask of TESTEN
                                                                            field.*/
  #define CRACENCORE_RNGCONTROL_CONTROL_TESTEN_Min (0x0UL) /*!< Min enumerator value of TESTEN field.                          */
  #define CRACENCORE_RNGCONTROL_CONTROL_TESTEN_Max (0x1UL) /*!< Max enumerator value of TESTEN field.                          */
  #define CRACENCORE_RNGCONTROL_CONTROL_TESTEN_NORMAL (0x0UL) /*!< Noise source (normal mode).                                 */
  #define CRACENCORE_RNGCONTROL_CONTROL_TESTEN_TEST (0x1UL) /*!< Test data register (test mode).                               */

/* CONDBYPASS @Bit 3 : Conditioning function bypass. */
  #define CRACENCORE_RNGCONTROL_CONTROL_CONDBYPASS_Pos (3UL) /*!< Position of CONDBYPASS field.                                */
  #define CRACENCORE_RNGCONTROL_CONTROL_CONDBYPASS_Msk (0x1UL << CRACENCORE_RNGCONTROL_CONTROL_CONDBYPASS_Pos) /*!< Bit mask of
                                                                            CONDBYPASS field.*/
  #define CRACENCORE_RNGCONTROL_CONTROL_CONDBYPASS_Min (0x0UL) /*!< Min enumerator value of CONDBYPASS field.                  */
  #define CRACENCORE_RNGCONTROL_CONTROL_CONDBYPASS_Max (0x1UL) /*!< Max enumerator value of CONDBYPASS field.                  */
  #define CRACENCORE_RNGCONTROL_CONTROL_CONDBYPASS_NORMAL (0x0UL) /*!< the conditioning function is used (normal mode).        */
  #define CRACENCORE_RNGCONTROL_CONTROL_CONDBYPASS_BYPASS (0x1UL) /*!< the conditioning function is bypassed (to observe entropy
                                                                       source directly).*/

/* INTENREP @Bit 4 : Interrupt enable for Repetition Count Test failure. */
  #define CRACENCORE_RNGCONTROL_CONTROL_INTENREP_Pos (4UL) /*!< Position of INTENREP field.                                    */
  #define CRACENCORE_RNGCONTROL_CONTROL_INTENREP_Msk (0x1UL << CRACENCORE_RNGCONTROL_CONTROL_INTENREP_Pos) /*!< Bit mask of
                                                                            INTENREP field.*/

/* INTENPROP @Bit 5 : Interrupt enable for Adaptive Proportion Test failure (1024-sample window). */
  #define CRACENCORE_RNGCONTROL_CONTROL_INTENPROP_Pos (5UL) /*!< Position of INTENPROP field.                                  */
  #define CRACENCORE_RNGCONTROL_CONTROL_INTENPROP_Msk (0x1UL << CRACENCORE_RNGCONTROL_CONTROL_INTENPROP_Pos) /*!< Bit mask of
                                                                            INTENPROP field.*/

/* INTENFULL @Bit 7 : Interrupt enable for FIFO full. */
  #define CRACENCORE_RNGCONTROL_CONTROL_INTENFULL_Pos (7UL) /*!< Position of INTENFULL field.                                  */
  #define CRACENCORE_RNGCONTROL_CONTROL_INTENFULL_Msk (0x1UL << CRACENCORE_RNGCONTROL_CONTROL_INTENFULL_Pos) /*!< Bit mask of
                                                                            INTENFULL field.*/

/* SOFTRST @Bit 8 : Software reset: */
  #define CRACENCORE_RNGCONTROL_CONTROL_SOFTRST_Pos (8UL) /*!< Position of SOFTRST field.                                      */
  #define CRACENCORE_RNGCONTROL_CONTROL_SOFTRST_Msk (0x1UL << CRACENCORE_RNGCONTROL_CONTROL_SOFTRST_Pos) /*!< Bit mask of
                                                                            SOFTRST field.*/
  #define CRACENCORE_RNGCONTROL_CONTROL_SOFTRST_Min (0x0UL) /*!< Min enumerator value of SOFTRST field.                        */
  #define CRACENCORE_RNGCONTROL_CONTROL_SOFTRST_Max (0x1UL) /*!< Max enumerator value of SOFTRST field.                        */
  #define CRACENCORE_RNGCONTROL_CONTROL_SOFTRST_NORMAL (0x0UL) /*!< Normal mode.                                               */
  #define CRACENCORE_RNGCONTROL_CONTROL_SOFTRST_CTEST (0x1UL) /*!< The continuous test, the conditioning function and the FIFO
                                                                   are reset.*/

/* INTENPRE @Bit 9 : Interrupt enable for AIS31 preliminary noise alarm. */
  #define CRACENCORE_RNGCONTROL_CONTROL_INTENPRE_Pos (9UL) /*!< Position of INTENPRE field.                                    */
  #define CRACENCORE_RNGCONTROL_CONTROL_INTENPRE_Msk (0x1UL << CRACENCORE_RNGCONTROL_CONTROL_INTENPRE_Pos) /*!< Bit mask of
                                                                            INTENPRE field.*/

/* INTENALM @Bit 10 : Interrupt enable for AIS31 noise alarm. */
  #define CRACENCORE_RNGCONTROL_CONTROL_INTENALM_Pos (10UL) /*!< Position of INTENALM field.                                   */
  #define CRACENCORE_RNGCONTROL_CONTROL_INTENALM_Msk (0x1UL << CRACENCORE_RNGCONTROL_CONTROL_INTENALM_Pos) /*!< Bit mask of
                                                                            INTENALM field.*/

/* FORCEACTIVEROS @Bit 11 : Force oscillators to run when FIFO is full. */
  #define CRACENCORE_RNGCONTROL_CONTROL_FORCEACTIVEROS_Pos (11UL) /*!< Position of FORCEACTIVEROS field.                       */
  #define CRACENCORE_RNGCONTROL_CONTROL_FORCEACTIVEROS_Msk (0x1UL << CRACENCORE_RNGCONTROL_CONTROL_FORCEACTIVEROS_Pos) /*!< Bit
                                                                            mask of FORCEACTIVEROS field.*/

/* HEALTHTESTBYPASS @Bit 12 : Bypass NIST tests such that the results of the start-up and online test do not affect the FSM
                              state. */

  #define CRACENCORE_RNGCONTROL_CONTROL_HEALTHTESTBYPASS_Pos (12UL) /*!< Position of HEALTHTESTBYPASS field.                   */
  #define CRACENCORE_RNGCONTROL_CONTROL_HEALTHTESTBYPASS_Msk (0x1UL << CRACENCORE_RNGCONTROL_CONTROL_HEALTHTESTBYPASS_Pos) /*!<
                                                                            Bit mask of HEALTHTESTBYPASS field.*/

/* AIS31BYPASS @Bit 13 : Bypass AIS31 tests such that the results of the start-up and online tests do not affect the FSM state.
                         */

  #define CRACENCORE_RNGCONTROL_CONTROL_AIS31BYPASS_Pos (13UL) /*!< Position of AIS31BYPASS field.                             */
  #define CRACENCORE_RNGCONTROL_CONTROL_AIS31BYPASS_Msk (0x1UL << CRACENCORE_RNGCONTROL_CONTROL_AIS31BYPASS_Pos) /*!< Bit mask
                                                                            of AIS31BYPASS field.*/

/* HEALTHTESTSEL @Bit 14 : Select input to health test module: */
  #define CRACENCORE_RNGCONTROL_CONTROL_HEALTHTESTSEL_Pos (14UL) /*!< Position of HEALTHTESTSEL field.                         */
  #define CRACENCORE_RNGCONTROL_CONTROL_HEALTHTESTSEL_Msk (0x1UL << CRACENCORE_RNGCONTROL_CONTROL_HEALTHTESTSEL_Pos) /*!< Bit
                                                                            mask of HEALTHTESTSEL field.*/
  #define CRACENCORE_RNGCONTROL_CONTROL_HEALTHTESTSEL_Min (0x0UL) /*!< Min enumerator value of HEALTHTESTSEL field.            */
  #define CRACENCORE_RNGCONTROL_CONTROL_HEALTHTESTSEL_Max (0x1UL) /*!< Max enumerator value of HEALTHTESTSEL field.            */
  #define CRACENCORE_RNGCONTROL_CONTROL_HEALTHTESTSEL_BEFORE (0x0UL) /*!< Before conditioning.                                 */
  #define CRACENCORE_RNGCONTROL_CONTROL_HEALTHTESTSEL_AFTER (0x1UL) /*!< After conditioning.                                   */

/* AIS31TESTSEL @Bit 15 : Select input to the AIS31 test module: */
  #define CRACENCORE_RNGCONTROL_CONTROL_AIS31TESTSEL_Pos (15UL) /*!< Position of AIS31TESTSEL field.                           */
  #define CRACENCORE_RNGCONTROL_CONTROL_AIS31TESTSEL_Msk (0x1UL << CRACENCORE_RNGCONTROL_CONTROL_AIS31TESTSEL_Pos) /*!< Bit mask
                                                                            of AIS31TESTSEL field.*/
  #define CRACENCORE_RNGCONTROL_CONTROL_AIS31TESTSEL_Min (0x0UL) /*!< Min enumerator value of AIS31TESTSEL field.              */
  #define CRACENCORE_RNGCONTROL_CONTROL_AIS31TESTSEL_Max (0x1UL) /*!< Max enumerator value of AIS31TESTSEL field.              */
  #define CRACENCORE_RNGCONTROL_CONTROL_AIS31TESTSEL_BEFORE (0x0UL) /*!< Before conditioning.                                  */
  #define CRACENCORE_RNGCONTROL_CONTROL_AIS31TESTSEL_AFTER (0x1UL) /*!< After conditioning.                                    */

/* NB128BITBLOCKS @Bits 16..19 : Number of 128 bit blocks used in AES-CBCMAC post-processing. */
  #define CRACENCORE_RNGCONTROL_CONTROL_NB128BITBLOCKS_Pos (16UL) /*!< Position of NB128BITBLOCKS field.                       */
  #define CRACENCORE_RNGCONTROL_CONTROL_NB128BITBLOCKS_Msk (0xFUL << CRACENCORE_RNGCONTROL_CONTROL_NB128BITBLOCKS_Pos) /*!< Bit
                                                                            mask of NB128BITBLOCKS field.*/

