NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54l15/nrf54l15_types.h
/* ECC @Bit 18 : Support error correction. */
  #define CRACENCORE_PK_HWCONFIG_ECC_Pos (18UL)      /*!< Position of ECC field.                                               */
  #define CRACENCORE_PK_HWCONFIG_ECC_Msk (0x1UL << CRACENCORE_PK_HWCONFIG_ECC_Pos) /*!< Bit mask of ECC field.                 */

/* P256 @Bit 20 : Support ECC P256 acceleration. */
  #define CRACENCORE_PK_HWCONFIG_P256_Pos (20UL)     /*!< Position of P256 field.                                              */
  #define CRACENCORE_PK_HWCONFIG_P256_Msk (0x1UL << CRACENCORE_PK_HWCONFIG_P256_Pos) /*!< Bit mask of P256 field.              */

/* P384 @Bit 21 : Support ECC P384 acceleration. */
  #define CRACENCORE_PK_HWCONFIG_P384_Pos (21UL)     /*!< Position of P384 field.                                              */
  #define CRACENCORE_PK_HWCONFIG_P384_Msk (0x1UL << CRACENCORE_PK_HWCONFIG_P384_Pos) /*!< Bit mask of P384 field.              */

/* P521 @Bit 22 : Support ECC P521 acceleration. */
  #define CRACENCORE_PK_HWCONFIG_P521_Pos (22UL)     /*!< Position of P521 field.                                              */
  #define CRACENCORE_PK_HWCONFIG_P521_Msk (0x1UL << CRACENCORE_PK_HWCONFIG_P521_Pos) /*!< Bit mask of P521 field.              */

/* P192 @Bit 23 : Support ECC P192 acceleration. */
  #define CRACENCORE_PK_HWCONFIG_P192_Pos (23UL)     /*!< Position of P192 field.                                              */
  #define CRACENCORE_PK_HWCONFIG_P192_Msk (0x1UL << CRACENCORE_PK_HWCONFIG_P192_Pos) /*!< Bit mask of P192 field.              */

/* X25519 @Bit 24 : Support Curve25519/Ed25519 acceleration. */
  #define CRACENCORE_PK_HWCONFIG_X25519_Pos (24UL)   /*!< Position of X25519 field.                                            */
  #define CRACENCORE_PK_HWCONFIG_X25519_Msk (0x1UL << CRACENCORE_PK_HWCONFIG_X25519_Pos) /*!< Bit mask of X25519 field.        */

/* AHBMASTER @Bit 25 : Memory access */
  #define CRACENCORE_PK_HWCONFIG_AHBMASTER_Pos (25UL) /*!< Position of AHBMASTER field.                                        */
  #define CRACENCORE_PK_HWCONFIG_AHBMASTER_Msk (0x1UL << CRACENCORE_PK_HWCONFIG_AHBMASTER_Pos) /*!< Bit mask of AHBMASTER
                                                                            field.*/
  #define CRACENCORE_PK_HWCONFIG_AHBMASTER_Min (0x0UL) /*!< Min enumerator value of AHBMASTER field.                           */
  #define CRACENCORE_PK_HWCONFIG_AHBMASTER_Max (0x1UL) /*!< Max enumerator value of AHBMASTER field.                           */
  #define CRACENCORE_PK_HWCONFIG_AHBMASTER_SLAVE (0x0UL) /*!< Memory access through AHB Slave and internally in the PKE.       */
  #define CRACENCORE_PK_HWCONFIG_AHBMASTER_MASTER (0x1UL) /*!< Memory access through AHB Master, outside the PKE.              */

/* DISABLESMX @Bit 29 : State of DisableSMx input (high when SM2/SM9 operations are disabled). */
  #define CRACENCORE_PK_HWCONFIG_DISABLESMX_Pos (29UL) /*!< Position of DISABLESMX field.                                      */
  #define CRACENCORE_PK_HWCONFIG_DISABLESMX_Msk (0x1UL << CRACENCORE_PK_HWCONFIG_DISABLESMX_Pos) /*!< Bit mask of DISABLESMX
                                                                            field.*/

/* DISABLECLRMEM @Bit 30 : State of DisableClrMem input (high when automatic clear of the RAM after reset is disabled). */
  #define CRACENCORE_PK_HWCONFIG_DISABLECLRMEM_Pos (30UL) /*!< Position of DISABLECLRMEM field.                                */
  #define CRACENCORE_PK_HWCONFIG_DISABLECLRMEM_Msk (0x1UL << CRACENCORE_PK_HWCONFIG_DISABLECLRMEM_Pos) /*!< Bit mask of
                                                                            DISABLECLRMEM field.*/

/* DISABLECM @Bit 31 : State of DisableCM input (high when counter-measures are disabled). */
  #define CRACENCORE_PK_HWCONFIG_DISABLECM_Pos (31UL) /*!< Position of DISABLECM field.                                        */
  #define CRACENCORE_PK_HWCONFIG_DISABLECM_Msk (0x1UL << CRACENCORE_PK_HWCONFIG_DISABLECM_Pos) /*!< Bit mask of DISABLECM
                                                                            field.*/


/* CRACENCORE_PK_OPSIZE: Operand size register. */
  #define CRACENCORE_PK_OPSIZE_ResetValue (0x00001000UL) /*!< Reset value of OPSIZE register.                                  */

/* OPSIZE @Bits 0..12 : Operand size (number of bytes): This register is used when the memory is accessed via AHB Master */
  #define CRACENCORE_PK_OPSIZE_OPSIZE_Pos (0UL)      /*!< Position of OPSIZE field.                                            */
  #define CRACENCORE_PK_OPSIZE_OPSIZE_Msk (0x1FFFUL << CRACENCORE_PK_OPSIZE_OPSIZE_Pos) /*!< Bit mask of OPSIZE field.         */
  #define CRACENCORE_PK_OPSIZE_OPSIZE_Min (0x0100UL) /*!< Min enumerator value of OPSIZE field.                                */
  #define CRACENCORE_PK_OPSIZE_OPSIZE_Max (0x1000UL) /*!< Max enumerator value of OPSIZE field.                                */
  #define CRACENCORE_PK_OPSIZE_OPSIZE_OPSIZE256 (0x0100UL) /*!< 256 bytes.                                                     */
  #define CRACENCORE_PK_OPSIZE_OPSIZE_OPSIZE521 (0x0209UL) /*!< 521 bytes.                                                     */
  #define CRACENCORE_PK_OPSIZE_OPSIZE_OPSIZE2048 (0x0800UL) /*!< 2048 bytes.                                                   */
  #define CRACENCORE_PK_OPSIZE_OPSIZE_OPSIZE3072 (0x0C00UL) /*!< 3072 bytes.                                                   */
  #define CRACENCORE_PK_OPSIZE_OPSIZE_OPSIZE4096 (0x1000UL) /*!< 4096 bytes.                                                   */


/* CRACENCORE_PK_RAMERRORINJECT: RAM error injection register. */
  #define CRACENCORE_PK_RAMERRORINJECT_ResetValue (0x03FF03FFUL) /*!< Reset value of RAMERRORINJECT register.                  */

/* BITERROR1 @Bits 0..9 : Bit position of first error */
  #define CRACENCORE_PK_RAMERRORINJECT_BITERROR1_Pos (0UL) /*!< Position of BITERROR1 field.                                   */
  #define CRACENCORE_PK_RAMERRORINJECT_BITERROR1_Msk (0x3FFUL << CRACENCORE_PK_RAMERRORINJECT_BITERROR1_Pos) /*!< Bit mask of
                                                                            BITERROR1 field.*/

/* BITERROR2 @Bits 16..25 : Bit position of second error */
  #define CRACENCORE_PK_RAMERRORINJECT_BITERROR2_Pos (16UL) /*!< Position of BITERROR2 field.                                  */
  #define CRACENCORE_PK_RAMERRORINJECT_BITERROR2_Msk (0x3FFUL << CRACENCORE_PK_RAMERRORINJECT_BITERROR2_Pos) /*!< Bit mask of
                                                                            BITERROR2 field.*/


/* CRACENCORE_PK_RAMERRORSTATUS: RAM error status register. */
  #define CRACENCORE_PK_RAMERRORSTATUS_ResetValue (0x00000000UL) /*!< Reset value of RAMERRORSTATUS register.                  */

/* RAMCORRECTION @Bit 0 : This bit indicates that a 1-bit error has been detected and corrected on RAM interface */
  #define CRACENCORE_PK_RAMERRORSTATUS_RAMCORRECTION_Pos (0UL) /*!< Position of RAMCORRECTION field.                           */
  #define CRACENCORE_PK_RAMERRORSTATUS_RAMCORRECTION_Msk (0x1UL << CRACENCORE_PK_RAMERRORSTATUS_RAMCORRECTION_Pos) /*!< Bit mask
                                                                            of RAMCORRECTION field.*/

/* RAMFAILURE @Bit 1 : This bit indicates that an uncorrectable error has been detected on the data RAM interface */
  #define CRACENCORE_PK_RAMERRORSTATUS_RAMFAILURE_Pos (1UL) /*!< Position of RAMFAILURE field.                                 */
  #define CRACENCORE_PK_RAMERRORSTATUS_RAMFAILURE_Msk (0x1UL << CRACENCORE_PK_RAMERRORSTATUS_RAMFAILURE_Pos) /*!< Bit mask of
                                                                            RAMFAILURE field.*/



/* ================================================== Struct CRACENCORE_IKG ================================================== */
/**
  * @brief IKG [CRACENCORE_IKG] (unspecified)
  */
typedef struct {
  __IOM uint32_t  START;                             /*!< (@ 0x00000000) Start register.                                       */
  __IOM uint32_t  STATUS;                            /*!< (@ 0x00000004) Status register.                                      */
  __IOM uint32_t  INITDATA;                          /*!< (@ 0x00000008) InitData register.                                    */
  __IOM uint32_t  NONCE;                             /*!< (@ 0x0000000C) Nonce register.                                       */
  __IOM uint32_t  PERSONALISATIONSTRING;             /*!< (@ 0x00000010) Personalisation String register.                      */
  __IOM uint32_t  RESEEDINTERVALLSB;                 /*!< (@ 0x00000014) Reseed Interval LSB register.                         */
  __IOM uint32_t  RESEEDINTERVALMSB;                 /*!< (@ 0x00000018) Reseed Interval MSB register.                         */
  __IOM uint32_t  PKECONTROL;                        /*!< (@ 0x0000001C) PKE Control register.                                 */
  __IOM uint32_t  PKECOMMAND;                        /*!< (@ 0x00000020) PKE Command register.                                 */
  __IOM uint32_t  PKESTATUS;                         /*!< (@ 0x00000024) PKE Status register.                                  */
  __IOM uint32_t  SOFTRST;                           /*!< (@ 0x00000028) SoftRst register.                                     */
  __IOM uint32_t  HWCONFIG;                          /*!< (@ 0x0000002C) HwConfig register.                                    */
} NRF_CRACENCORE_IKG_Type;                           /*!< Size = 48 (0x030)                                                    */

/* CRACENCORE_IKG_START: Start register. */
  #define CRACENCORE_IKG_START_ResetValue (0x00000000UL) /*!< Reset value of START register.                                   */

/* START @Bit 0 : Start the Isolated Key Generation. */
  #define CRACENCORE_IKG_START_START_Pos (0UL)       /*!< Position of START field.                                             */
  #define CRACENCORE_IKG_START_START_Msk (0x1UL << CRACENCORE_IKG_START_START_Pos) /*!< Bit mask of START field.               */


