NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54l15/nrf54l15_types.h
/* CH13 @Bit 13 : Channel 13 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH13_Pos (13UL)              /*!< Position of CH13 field.                                              */
  #define DPPIC_CHENSET_CH13_Msk (0x1UL << DPPIC_CHENSET_CH13_Pos) /*!< Bit mask of CH13 field.                                */
  #define DPPIC_CHENSET_CH13_Min (0x0UL)             /*!< Min enumerator value of CH13 field.                                  */
  #define DPPIC_CHENSET_CH13_Max (0x1UL)             /*!< Max enumerator value of CH13 field.                                  */
  #define DPPIC_CHENSET_CH13_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH13_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH13_Set (0x1UL)             /*!< Write: Enable channel                                                */

/* CH14 @Bit 14 : Channel 14 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH14_Pos (14UL)              /*!< Position of CH14 field.                                              */
  #define DPPIC_CHENSET_CH14_Msk (0x1UL << DPPIC_CHENSET_CH14_Pos) /*!< Bit mask of CH14 field.                                */
  #define DPPIC_CHENSET_CH14_Min (0x0UL)             /*!< Min enumerator value of CH14 field.                                  */
  #define DPPIC_CHENSET_CH14_Max (0x1UL)             /*!< Max enumerator value of CH14 field.                                  */
  #define DPPIC_CHENSET_CH14_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH14_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH14_Set (0x1UL)             /*!< Write: Enable channel                                                */

/* CH15 @Bit 15 : Channel 15 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH15_Pos (15UL)              /*!< Position of CH15 field.                                              */
  #define DPPIC_CHENSET_CH15_Msk (0x1UL << DPPIC_CHENSET_CH15_Pos) /*!< Bit mask of CH15 field.                                */
  #define DPPIC_CHENSET_CH15_Min (0x0UL)             /*!< Min enumerator value of CH15 field.                                  */
  #define DPPIC_CHENSET_CH15_Max (0x1UL)             /*!< Max enumerator value of CH15 field.                                  */
  #define DPPIC_CHENSET_CH15_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH15_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH15_Set (0x1UL)             /*!< Write: Enable channel                                                */

/* CH16 @Bit 16 : Channel 16 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH16_Pos (16UL)              /*!< Position of CH16 field.                                              */
  #define DPPIC_CHENSET_CH16_Msk (0x1UL << DPPIC_CHENSET_CH16_Pos) /*!< Bit mask of CH16 field.                                */
  #define DPPIC_CHENSET_CH16_Min (0x0UL)             /*!< Min enumerator value of CH16 field.                                  */
  #define DPPIC_CHENSET_CH16_Max (0x1UL)             /*!< Max enumerator value of CH16 field.                                  */
  #define DPPIC_CHENSET_CH16_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH16_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH16_Set (0x1UL)             /*!< Write: Enable channel                                                */

/* CH17 @Bit 17 : Channel 17 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH17_Pos (17UL)              /*!< Position of CH17 field.                                              */
  #define DPPIC_CHENSET_CH17_Msk (0x1UL << DPPIC_CHENSET_CH17_Pos) /*!< Bit mask of CH17 field.                                */
  #define DPPIC_CHENSET_CH17_Min (0x0UL)             /*!< Min enumerator value of CH17 field.                                  */
  #define DPPIC_CHENSET_CH17_Max (0x1UL)             /*!< Max enumerator value of CH17 field.                                  */
  #define DPPIC_CHENSET_CH17_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH17_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH17_Set (0x1UL)             /*!< Write: Enable channel                                                */

/* CH18 @Bit 18 : Channel 18 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH18_Pos (18UL)              /*!< Position of CH18 field.                                              */
  #define DPPIC_CHENSET_CH18_Msk (0x1UL << DPPIC_CHENSET_CH18_Pos) /*!< Bit mask of CH18 field.                                */
  #define DPPIC_CHENSET_CH18_Min (0x0UL)             /*!< Min enumerator value of CH18 field.                                  */
  #define DPPIC_CHENSET_CH18_Max (0x1UL)             /*!< Max enumerator value of CH18 field.                                  */
  #define DPPIC_CHENSET_CH18_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH18_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH18_Set (0x1UL)             /*!< Write: Enable channel                                                */

/* CH19 @Bit 19 : Channel 19 enable set register. Writing 0 has no effect. */
  #define DPPIC_CHENSET_CH19_Pos (19UL)              /*!< Position of CH19 field.                                              */
  #define DPPIC_CHENSET_CH19_Msk (0x1UL << DPPIC_CHENSET_CH19_Pos) /*!< Bit mask of CH19 field.                                */
  #define DPPIC_CHENSET_CH19_Min (0x0UL)             /*!< Min enumerator value of CH19 field.                                  */
  #define DPPIC_CHENSET_CH19_Max (0x1UL)             /*!< Max enumerator value of CH19 field.                                  */
  #define DPPIC_CHENSET_CH19_Disabled (0x0UL)        /*!< Read: Channel disabled                                               */
  #define DPPIC_CHENSET_CH19_Enabled (0x1UL)         /*!< Read: Channel enabled                                                */
  #define DPPIC_CHENSET_CH19_Set (0x1UL)             /*!< Write: Enable channel                                                */

