NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54l15/nrf54l15_types.h
/* INSTEN2 @Bit 2 : Instruction event enable field. */
  #define ETM_TRCEVENTCTL1R_INSTEN2_Pos (2UL)        /*!< Position of INSTEN2 field.                                           */
  #define ETM_TRCEVENTCTL1R_INSTEN2_Msk (0x1UL << ETM_TRCEVENTCTL1R_INSTEN2_Pos) /*!< Bit mask of INSTEN2 field.               */
  #define ETM_TRCEVENTCTL1R_INSTEN2_Min (0x0UL)      /*!< Min enumerator value of INSTEN2 field.                               */
  #define ETM_TRCEVENTCTL1R_INSTEN2_Max (0x1UL)      /*!< Max enumerator value of INSTEN2 field.                               */
  #define ETM_TRCEVENTCTL1R_INSTEN2_Disabled (0x0UL) /*!< The trace unit does not generate an Event element.                   */
  #define ETM_TRCEVENTCTL1R_INSTEN2_Enabled (0x1UL)  /*!< The trace unit generates an Event element for event 2, in the
                                                          instruction trace stream.*/

/* INSTEN3 @Bit 3 : Instruction event enable field. */
  #define ETM_TRCEVENTCTL1R_INSTEN3_Pos (3UL)        /*!< Position of INSTEN3 field.                                           */
  #define ETM_TRCEVENTCTL1R_INSTEN3_Msk (0x1UL << ETM_TRCEVENTCTL1R_INSTEN3_Pos) /*!< Bit mask of INSTEN3 field.               */
  #define ETM_TRCEVENTCTL1R_INSTEN3_Min (0x0UL)      /*!< Min enumerator value of INSTEN3 field.                               */
  #define ETM_TRCEVENTCTL1R_INSTEN3_Max (0x1UL)      /*!< Max enumerator value of INSTEN3 field.                               */
  #define ETM_TRCEVENTCTL1R_INSTEN3_Disabled (0x0UL) /*!< The trace unit does not generate an Event element.                   */
  #define ETM_TRCEVENTCTL1R_INSTEN3_Enabled (0x1UL)  /*!< The trace unit generates an Event element for event 3, in the
                                                          instruction trace stream.*/

/* DATAEN @Bit 4 : Data event enable bit. */
  #define ETM_TRCEVENTCTL1R_DATAEN_Pos (4UL)         /*!< Position of DATAEN field.                                            */
  #define ETM_TRCEVENTCTL1R_DATAEN_Msk (0x1UL << ETM_TRCEVENTCTL1R_DATAEN_Pos) /*!< Bit mask of DATAEN field.                  */
  #define ETM_TRCEVENTCTL1R_DATAEN_Min (0x0UL)       /*!< Min enumerator value of DATAEN field.                                */
  #define ETM_TRCEVENTCTL1R_DATAEN_Max (0x1UL)       /*!< Max enumerator value of DATAEN field.                                */
  #define ETM_TRCEVENTCTL1R_DATAEN_Disabled (0x0UL)  /*!< The trace unit does not generate an Event element if event 0 occurs. */
  #define ETM_TRCEVENTCTL1R_DATAEN_Enabled (0x1UL)   /*!< The trace unit generates an Event element in the data trace stream if
                                                          event 0 occurs.*/

/* ATB @Bit 11 : AMBA Trace Bus (ATB) trigger enable bit. */
  #define ETM_TRCEVENTCTL1R_ATB_Pos (11UL)           /*!< Position of ATB field.                                               */
  #define ETM_TRCEVENTCTL1R_ATB_Msk (0x1UL << ETM_TRCEVENTCTL1R_ATB_Pos) /*!< Bit mask of ATB field.                           */
  #define ETM_TRCEVENTCTL1R_ATB_Min (0x0UL)          /*!< Min enumerator value of ATB field.                                   */
  #define ETM_TRCEVENTCTL1R_ATB_Max (0x1UL)          /*!< Max enumerator value of ATB field.                                   */
  #define ETM_TRCEVENTCTL1R_ATB_Disabled (0x0UL)     /*!< ATB trigger is disabled.                                             */
  #define ETM_TRCEVENTCTL1R_ATB_Enabled (0x1UL)      /*!< ATB trigger is enabled. If a CoreSight ATB interface is implemented
                                                          then when event 0 occurs the trace unit generates an ATB event.*/

/* LPOVERRIDE @Bit 12 : Low-power state behavior override bit. Controls how a trace unit behaves in low-power state. */
  #define ETM_TRCEVENTCTL1R_LPOVERRIDE_Pos (12UL)    /*!< Position of LPOVERRIDE field.                                        */
  #define ETM_TRCEVENTCTL1R_LPOVERRIDE_Msk (0x1UL << ETM_TRCEVENTCTL1R_LPOVERRIDE_Pos) /*!< Bit mask of LPOVERRIDE field.      */
  #define ETM_TRCEVENTCTL1R_LPOVERRIDE_Min (0x0UL)   /*!< Min enumerator value of LPOVERRIDE field.                            */
  #define ETM_TRCEVENTCTL1R_LPOVERRIDE_Max (0x1UL)   /*!< Max enumerator value of LPOVERRIDE field.                            */
  #define ETM_TRCEVENTCTL1R_LPOVERRIDE_Disabled (0x0UL) /*!< Trace unit low-power state behavior is not affected. That is, the
                                                             trace unit is enabled to enter low-power state.*/
  #define ETM_TRCEVENTCTL1R_LPOVERRIDE_Enabled (0x1UL) /*!< Trace unit low-power state behavior is overridden. That is, entry to
                                                            a low-power state does not affect the trace unit resources or trace
                                                            generation.*/


/* ETM_TRCSTALLCTLR: Enables trace unit functionality that prevents trace unit buffer overflows. Might ignore writes when the
                      trace unit is enabled or not idle. Must be programmed if TRCIDR3.STALLCTL == 1. */

  #define ETM_TRCSTALLCTLR_ResetValue (0x00000000UL) /*!< Reset value of TRCSTALLCTLR register.                                */

/* LEVEL @Bits 0..3 : Threshold level field. If LEVEL is nonzero then a trace unit might suppress the generation of: Global
                      timestamps in the instruction trace stream and the data trace stream. Cycle counting in the instruction
                      trace stream, although the cumulative cycle count remains correct. */

  #define ETM_TRCSTALLCTLR_LEVEL_Pos (0UL)           /*!< Position of LEVEL field.                                             */
  #define ETM_TRCSTALLCTLR_LEVEL_Msk (0xFUL << ETM_TRCSTALLCTLR_LEVEL_Pos) /*!< Bit mask of LEVEL field.                       */
  #define ETM_TRCSTALLCTLR_LEVEL_Min (0x0UL)         /*!< Zero invasion. This setting has a greater risk of a FIFO overflow    */
  #define ETM_TRCSTALLCTLR_LEVEL_Max (0xFUL)         /*!< Maximum invasion occurs but there is less risk of a FIFO overflow.   */

/* ISTALL @Bit 8 : Instruction stall bit. Controls if a trace unit can stall the PE when the instruction trace buffer space is
                   less than LEVEL. */

  #define ETM_TRCSTALLCTLR_ISTALL_Pos (8UL)          /*!< Position of ISTALL field.                                            */
  #define ETM_TRCSTALLCTLR_ISTALL_Msk (0x1UL << ETM_TRCSTALLCTLR_ISTALL_Pos) /*!< Bit mask of ISTALL field.                    */
  #define ETM_TRCSTALLCTLR_ISTALL_Min (0x0UL)        /*!< Min enumerator value of ISTALL field.                                */
  #define ETM_TRCSTALLCTLR_ISTALL_Max (0x1UL)        /*!< Max enumerator value of ISTALL field.                                */
  #define ETM_TRCSTALLCTLR_ISTALL_Disabled (0x0UL)   /*!< The trace unit must not stall the PE.                                */
  #define ETM_TRCSTALLCTLR_ISTALL_Enabled (0x1UL)    /*!< The trace unit can stall the PE.                                     */

