NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54l15/nrf54l15_types.h
/* FICR_INFO_UUID: 128-bit Universally Unique IDentifier (UUID). */
  #define FICR_INFO_UUID_MaxCount (4UL)              /*!< Max size of UUID[4] array.                                           */
  #define FICR_INFO_UUID_MaxIndex (3UL)              /*!< Max index of UUID[4] array.                                          */
  #define FICR_INFO_UUID_MinIndex (0UL)              /*!< Min index of UUID[4] array.                                          */
  #define FICR_INFO_UUID_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of UUID[4] register.                                     */

/* UUID @Bits 0..31 : Device UUID [n]. */
  #define FICR_INFO_UUID_UUID_Pos (0UL)              /*!< Position of UUID field.                                              */
  #define FICR_INFO_UUID_UUID_Msk (0xFFFFFFFFUL << FICR_INFO_UUID_UUID_Pos) /*!< Bit mask of UUID field.                       */


/* FICR_INFO_PART: Part code */
  #define FICR_INFO_PART_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of PART register.                                        */

/* PART @Bits 0..31 : Part code */
  #define FICR_INFO_PART_PART_Pos (0UL)              /*!< Position of PART field.                                              */
  #define FICR_INFO_PART_PART_Msk (0xFFFFFFFFUL << FICR_INFO_PART_PART_Pos) /*!< Bit mask of PART field.                       */
  #define FICR_INFO_PART_PART_Min (0x00054B05UL)     /*!< Min enumerator value of PART field.                                  */
  #define FICR_INFO_PART_PART_Max (0xFFFFFFFFUL)     /*!< Max enumerator value of PART field.                                  */
  #define FICR_INFO_PART_PART_N54L15 (0x00054B15UL)  /*!< nRF54L15                                                             */
  #define FICR_INFO_PART_PART_N54L10 (0x00054B10UL)  /*!< nRF54L10                                                             */
  #define FICR_INFO_PART_PART_N54L05 (0x00054B05UL)  /*!< nRF54L05                                                             */
  #define FICR_INFO_PART_PART_Unspecified (0xFFFFFFFFUL) /*!< Unspecified                                                      */


/* FICR_INFO_VARIANT: Part Variant, Hardware version and Production configuration */
  #define FICR_INFO_VARIANT_ResetValue (0xFFFFFFFFUL) /*!< Reset value of VARIANT register.                                    */

/* VARIANT @Bits 0..31 : Part Variant, Hardware version and Production configuration, encoded as ASCII */
  #define FICR_INFO_VARIANT_VARIANT_Pos (0UL)        /*!< Position of VARIANT field.                                           */
  #define FICR_INFO_VARIANT_VARIANT_Msk (0xFFFFFFFFUL << FICR_INFO_VARIANT_VARIANT_Pos) /*!< Bit mask of VARIANT field.        */
  #define FICR_INFO_VARIANT_VARIANT_Min (0xFFFFFFFFUL) /*!< Min enumerator value of VARIANT field.                             */
  #define FICR_INFO_VARIANT_VARIANT_Max (0xFFFFFFFFUL) /*!< Max enumerator value of VARIANT field.                             */
  #define FICR_INFO_VARIANT_VARIANT_Unspecified (0xFFFFFFFFUL) /*!< Unspecified                                                */


/* FICR_INFO_PACKAGE: Package option */
  #define FICR_INFO_PACKAGE_ResetValue (0xFFFFFFFFUL) /*!< Reset value of PACKAGE register.                                    */

/* PACKAGE @Bits 0..31 : Package option */
  #define FICR_INFO_PACKAGE_PACKAGE_Pos (0UL)        /*!< Position of PACKAGE field.                                           */
  #define FICR_INFO_PACKAGE_PACKAGE_Msk (0xFFFFFFFFUL << FICR_INFO_PACKAGE_PACKAGE_Pos) /*!< Bit mask of PACKAGE field.        */
  #define FICR_INFO_PACKAGE_PACKAGE_Min (0xFFFFFFFFUL) /*!< Min enumerator value of PACKAGE field.                             */
  #define FICR_INFO_PACKAGE_PACKAGE_Max (0xFFFFFFFFUL) /*!< Max enumerator value of PACKAGE field.                             */
  #define FICR_INFO_PACKAGE_PACKAGE_Unspecified (0xFFFFFFFFUL) /*!< Unspecified                                                */


/* FICR_INFO_RAM: RAM size (KB) */
  #define FICR_INFO_RAM_ResetValue (0xFFFFFFFFUL)    /*!< Reset value of RAM register.                                         */

/* RAM @Bits 0..31 : RAM size (KB) */
  #define FICR_INFO_RAM_RAM_Pos (0UL)                /*!< Position of RAM field.                                               */
  #define FICR_INFO_RAM_RAM_Msk (0xFFFFFFFFUL << FICR_INFO_RAM_RAM_Pos) /*!< Bit mask of RAM field.                            */
  #define FICR_INFO_RAM_RAM_Min (0x00000060UL)       /*!< Min enumerator value of RAM field.                                   */
  #define FICR_INFO_RAM_RAM_Max (0xFFFFFFFFUL)       /*!< Max enumerator value of RAM field.                                   */
  #define FICR_INFO_RAM_RAM_K256 (0x00000100UL)      /*!< 256 kByte RAM                                                        */
  #define FICR_INFO_RAM_RAM_K192 (0x000000C0UL)      /*!< 192 kByte RAM                                                        */
  #define FICR_INFO_RAM_RAM_K96 (0x00000060UL)       /*!< 96 kByte RAM                                                         */
  #define FICR_INFO_RAM_RAM_Unspecified (0xFFFFFFFFUL) /*!< Unspecified                                                        */


/* FICR_INFO_RRAM: RRAM size (KB) */
  #define FICR_INFO_RRAM_ResetValue (0xFFFFFFFFUL)   /*!< Reset value of RRAM register.                                        */

/* RRAM @Bits 0..31 : RRAM size (KB) */
  #define FICR_INFO_RRAM_RRAM_Pos (0UL)              /*!< Position of RRAM field.                                              */
  #define FICR_INFO_RRAM_RRAM_Msk (0xFFFFFFFFUL << FICR_INFO_RRAM_RRAM_Pos) /*!< Bit mask of RRAM field.                       */
  #define FICR_INFO_RRAM_RRAM_Min (0x000001F4UL)     /*!< Min enumerator value of RRAM field.                                  */
  #define FICR_INFO_RRAM_RRAM_Max (0xFFFFFFFFUL)     /*!< Max enumerator value of RRAM field.                                  */
  #define FICR_INFO_RRAM_RRAM_K1524 (0x000005F4UL)   /*!< 1524 KByte RRAM                                                      */
  #define FICR_INFO_RRAM_RRAM_K1012 (0x000003F4UL)   /*!< 1012 KByte RRAM                                                      */
  #define FICR_INFO_RRAM_RRAM_K500 (0x000001F4UL)    /*!< 500 KByte RRAM                                                       */
  #define FICR_INFO_RRAM_RRAM_Unspecified (0xFFFFFFFFUL) /*!< Unspecified                                                      */



/* =================================================== Struct FICR_TRIMCNF =================================================== */
/**
  * @brief TRIMCNF [FICR_TRIMCNF] (unspecified)
  */
typedef struct {
  __IM  uint32_t  ADDR;                              /*!< (@ 0x00000000) Address of the register which will be written         */
  __IM  uint32_t  DATA;                              /*!< (@ 0x00000004) Data to be written into the register                  */
} NRF_FICR_TRIMCNF_Type;                             /*!< Size = 8 (0x008)                                                     */
