NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54l15/nrf54l15_types.h
/* CHIDX @Bits 0..7 : DPPI channel that event PWMREADY will publish to */
  #define GRTC_PUBLISH_PWMREADY_CHIDX_Pos (0UL)      /*!< Position of CHIDX field.                                             */
  #define GRTC_PUBLISH_PWMREADY_CHIDX_Msk (0xFFUL << GRTC_PUBLISH_PWMREADY_CHIDX_Pos) /*!< Bit mask of CHIDX field.            */
  #define GRTC_PUBLISH_PWMREADY_CHIDX_Min (0x00UL)   /*!< Min value of CHIDX field.                                            */
  #define GRTC_PUBLISH_PWMREADY_CHIDX_Max (0xFFUL)   /*!< Max size of CHIDX field.                                             */

/* EN @Bit 31 : (unspecified) */
  #define GRTC_PUBLISH_PWMREADY_EN_Pos (31UL)        /*!< Position of EN field.                                                */
  #define GRTC_PUBLISH_PWMREADY_EN_Msk (0x1UL << GRTC_PUBLISH_PWMREADY_EN_Pos) /*!< Bit mask of EN field.                      */
  #define GRTC_PUBLISH_PWMREADY_EN_Min (0x0UL)       /*!< Min enumerator value of EN field.                                    */
  #define GRTC_PUBLISH_PWMREADY_EN_Max (0x1UL)       /*!< Max enumerator value of EN field.                                    */
  #define GRTC_PUBLISH_PWMREADY_EN_Disabled (0x0UL)  /*!< Disable publishing                                                   */
  #define GRTC_PUBLISH_PWMREADY_EN_Enabled (0x1UL)   /*!< Enable publishing                                                    */


/* GRTC_PUBLISH_CLKOUTREADY: Publish configuration for event CLKOUTREADY */
  #define GRTC_PUBLISH_CLKOUTREADY_ResetValue (0x00000000UL) /*!< Reset value of PUBLISH_CLKOUTREADY register.                 */

/* CHIDX @Bits 0..7 : DPPI channel that event CLKOUTREADY will publish to */
  #define GRTC_PUBLISH_CLKOUTREADY_CHIDX_Pos (0UL)   /*!< Position of CHIDX field.                                             */
  #define GRTC_PUBLISH_CLKOUTREADY_CHIDX_Msk (0xFFUL << GRTC_PUBLISH_CLKOUTREADY_CHIDX_Pos) /*!< Bit mask of CHIDX field.      */
  #define GRTC_PUBLISH_CLKOUTREADY_CHIDX_Min (0x00UL) /*!< Min value of CHIDX field.                                           */
  #define GRTC_PUBLISH_CLKOUTREADY_CHIDX_Max (0xFFUL) /*!< Max size of CHIDX field.                                            */

/* EN @Bit 31 : (unspecified) */
  #define GRTC_PUBLISH_CLKOUTREADY_EN_Pos (31UL)     /*!< Position of EN field.                                                */
  #define GRTC_PUBLISH_CLKOUTREADY_EN_Msk (0x1UL << GRTC_PUBLISH_CLKOUTREADY_EN_Pos) /*!< Bit mask of EN field.                */
  #define GRTC_PUBLISH_CLKOUTREADY_EN_Min (0x0UL)    /*!< Min enumerator value of EN field.                                    */
  #define GRTC_PUBLISH_CLKOUTREADY_EN_Max (0x1UL)    /*!< Max enumerator value of EN field.                                    */
  #define GRTC_PUBLISH_CLKOUTREADY_EN_Disabled (0x0UL) /*!< Disable publishing                                                 */
  #define GRTC_PUBLISH_CLKOUTREADY_EN_Enabled (0x1UL) /*!< Enable publishing                                                   */


/* GRTC_SHORTS: Shortcuts between local events and tasks */
  #define GRTC_SHORTS_ResetValue (0x00000000UL)      /*!< Reset value of SHORTS register.                                      */

/* RTCOMPARE_CLEAR @Bit 0 : Shortcut between event RTCOMPARE and task CLEAR */
  #define GRTC_SHORTS_RTCOMPARE_CLEAR_Pos (0UL)      /*!< Position of RTCOMPARE_CLEAR field.                                   */
  #define GRTC_SHORTS_RTCOMPARE_CLEAR_Msk (0x1UL << GRTC_SHORTS_RTCOMPARE_CLEAR_Pos) /*!< Bit mask of RTCOMPARE_CLEAR field.   */
  #define GRTC_SHORTS_RTCOMPARE_CLEAR_Min (0x0UL)    /*!< Min enumerator value of RTCOMPARE_CLEAR field.                       */
  #define GRTC_SHORTS_RTCOMPARE_CLEAR_Max (0x1UL)    /*!< Max enumerator value of RTCOMPARE_CLEAR field.                       */
  #define GRTC_SHORTS_RTCOMPARE_CLEAR_Disabled (0x0UL) /*!< Disable shortcut                                                   */
  #define GRTC_SHORTS_RTCOMPARE_CLEAR_Enabled (0x1UL) /*!< Enable shortcut                                                     */


/* GRTC_INTEN0: Enable or disable interrupt */
  #define GRTC_INTEN0_ResetValue (0x00000000UL)      /*!< Reset value of INTEN0 register.                                      */

/* COMPARE0 @Bit 0 : Enable or disable interrupt for event COMPARE[0] */
  #define GRTC_INTEN0_COMPARE0_Pos (0UL)             /*!< Position of COMPARE0 field.                                          */
  #define GRTC_INTEN0_COMPARE0_Msk (0x1UL << GRTC_INTEN0_COMPARE0_Pos) /*!< Bit mask of COMPARE0 field.                        */
  #define GRTC_INTEN0_COMPARE0_Min (0x0UL)           /*!< Min enumerator value of COMPARE0 field.                              */
  #define GRTC_INTEN0_COMPARE0_Max (0x1UL)           /*!< Max enumerator value of COMPARE0 field.                              */
  #define GRTC_INTEN0_COMPARE0_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GRTC_INTEN0_COMPARE0_Enabled (0x1UL)       /*!< Enable                                                               */

/* COMPARE1 @Bit 1 : Enable or disable interrupt for event COMPARE[1] */
  #define GRTC_INTEN0_COMPARE1_Pos (1UL)             /*!< Position of COMPARE1 field.                                          */
  #define GRTC_INTEN0_COMPARE1_Msk (0x1UL << GRTC_INTEN0_COMPARE1_Pos) /*!< Bit mask of COMPARE1 field.                        */
  #define GRTC_INTEN0_COMPARE1_Min (0x0UL)           /*!< Min enumerator value of COMPARE1 field.                              */
  #define GRTC_INTEN0_COMPARE1_Max (0x1UL)           /*!< Max enumerator value of COMPARE1 field.                              */
  #define GRTC_INTEN0_COMPARE1_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GRTC_INTEN0_COMPARE1_Enabled (0x1UL)       /*!< Enable                                                               */

/* COMPARE2 @Bit 2 : Enable or disable interrupt for event COMPARE[2] */
  #define GRTC_INTEN0_COMPARE2_Pos (2UL)             /*!< Position of COMPARE2 field.                                          */
  #define GRTC_INTEN0_COMPARE2_Msk (0x1UL << GRTC_INTEN0_COMPARE2_Pos) /*!< Bit mask of COMPARE2 field.                        */
  #define GRTC_INTEN0_COMPARE2_Min (0x0UL)           /*!< Min enumerator value of COMPARE2 field.                              */
  #define GRTC_INTEN0_COMPARE2_Max (0x1UL)           /*!< Max enumerator value of COMPARE2 field.                              */
  #define GRTC_INTEN0_COMPARE2_Disabled (0x0UL)      /*!< Disable                                                              */
  #define GRTC_INTEN0_COMPARE2_Enabled (0x1UL)       /*!< Enable                                                               */

