NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54l15/nrf54l15_types.h
/* I2S_CONFIG_RATIO: MCK / LRCK ratio */
  #define I2S_CONFIG_RATIO_ResetValue (0x00000006UL) /*!< Reset value of RATIO register.                                       */

/* RATIO @Bits 0..3 : MCK / LRCK ratio */
  #define I2S_CONFIG_RATIO_RATIO_Pos (0UL)           /*!< Position of RATIO field.                                             */
  #define I2S_CONFIG_RATIO_RATIO_Msk (0xFUL << I2S_CONFIG_RATIO_RATIO_Pos) /*!< Bit mask of RATIO field.                       */
  #define I2S_CONFIG_RATIO_RATIO_Min (0x0UL)         /*!< Min enumerator value of RATIO field.                                 */
  #define I2S_CONFIG_RATIO_RATIO_Max (0x8UL)         /*!< Max enumerator value of RATIO field.                                 */
  #define I2S_CONFIG_RATIO_RATIO_32X (0x0UL)         /*!< LRCK = MCK / 32                                                      */
  #define I2S_CONFIG_RATIO_RATIO_48X (0x1UL)         /*!< LRCK = MCK / 48                                                      */
  #define I2S_CONFIG_RATIO_RATIO_64X (0x2UL)         /*!< LRCK = MCK / 64                                                      */
  #define I2S_CONFIG_RATIO_RATIO_96X (0x3UL)         /*!< LRCK = MCK / 96                                                      */
  #define I2S_CONFIG_RATIO_RATIO_128X (0x4UL)        /*!< LRCK = MCK / 128                                                     */
  #define I2S_CONFIG_RATIO_RATIO_192X (0x5UL)        /*!< LRCK = MCK / 192                                                     */
  #define I2S_CONFIG_RATIO_RATIO_256X (0x6UL)        /*!< LRCK = MCK / 256                                                     */
  #define I2S_CONFIG_RATIO_RATIO_384X (0x7UL)        /*!< LRCK = MCK / 384                                                     */
  #define I2S_CONFIG_RATIO_RATIO_512X (0x8UL)        /*!< LRCK = MCK / 512                                                     */


/* I2S_CONFIG_SWIDTH: Sample width */
  #define I2S_CONFIG_SWIDTH_ResetValue (0x00000001UL) /*!< Reset value of SWIDTH register.                                     */

/* SWIDTH @Bits 0..2 : Sample and half-frame width */
  #define I2S_CONFIG_SWIDTH_SWIDTH_Pos (0UL)         /*!< Position of SWIDTH field.                                            */
  #define I2S_CONFIG_SWIDTH_SWIDTH_Msk (0x7UL << I2S_CONFIG_SWIDTH_SWIDTH_Pos) /*!< Bit mask of SWIDTH field.                  */
  #define I2S_CONFIG_SWIDTH_SWIDTH_Min (0x0UL)       /*!< Min enumerator value of SWIDTH field.                                */
  #define I2S_CONFIG_SWIDTH_SWIDTH_Max (0x7UL)       /*!< Max enumerator value of SWIDTH field.                                */
  #define I2S_CONFIG_SWIDTH_SWIDTH_8Bit (0x0UL)      /*!< 8 bit sample.                                                        */
  #define I2S_CONFIG_SWIDTH_SWIDTH_16Bit (0x1UL)     /*!< 16 bit sample.                                                       */
  #define I2S_CONFIG_SWIDTH_SWIDTH_24Bit (0x2UL)     /*!< 24 bit sample.                                                       */
  #define I2S_CONFIG_SWIDTH_SWIDTH_32Bit (0x3UL)     /*!< 32 bit sample.                                                       */
  #define I2S_CONFIG_SWIDTH_SWIDTH_8BitIn16 (0x4UL)  /*!< 8 bit sample in a 16-bit half-frame.                                 */
  #define I2S_CONFIG_SWIDTH_SWIDTH_8BitIn32 (0x5UL)  /*!< 8 bit sample in a 32-bit half-frame.                                 */
  #define I2S_CONFIG_SWIDTH_SWIDTH_16BitIn32 (0x6UL) /*!< 16 bit sample in a 32-bit half-frame.                                */
  #define I2S_CONFIG_SWIDTH_SWIDTH_24BitIn32 (0x7UL) /*!< 24 bit sample in a 32-bit half-frame.                                */


/* I2S_CONFIG_ALIGN: Alignment of sample within a frame */
  #define I2S_CONFIG_ALIGN_ResetValue (0x00000000UL) /*!< Reset value of ALIGN register.                                       */

/* ALIGN @Bit 0 : Alignment of sample within a frame */
  #define I2S_CONFIG_ALIGN_ALIGN_Pos (0UL)           /*!< Position of ALIGN field.                                             */
  #define I2S_CONFIG_ALIGN_ALIGN_Msk (0x1UL << I2S_CONFIG_ALIGN_ALIGN_Pos) /*!< Bit mask of ALIGN field.                       */
  #define I2S_CONFIG_ALIGN_ALIGN_Min (0x0UL)         /*!< Min enumerator value of ALIGN field.                                 */
  #define I2S_CONFIG_ALIGN_ALIGN_Max (0x1UL)         /*!< Max enumerator value of ALIGN field.                                 */
  #define I2S_CONFIG_ALIGN_ALIGN_Left (0x0UL)        /*!< Left-aligned.                                                        */
  #define I2S_CONFIG_ALIGN_ALIGN_Right (0x1UL)       /*!< Right-aligned.                                                       */


/* I2S_CONFIG_FORMAT: Frame format */
  #define I2S_CONFIG_FORMAT_ResetValue (0x00000000UL) /*!< Reset value of FORMAT register.                                     */

/* FORMAT @Bit 0 : Frame format */
  #define I2S_CONFIG_FORMAT_FORMAT_Pos (0UL)         /*!< Position of FORMAT field.                                            */
  #define I2S_CONFIG_FORMAT_FORMAT_Msk (0x1UL << I2S_CONFIG_FORMAT_FORMAT_Pos) /*!< Bit mask of FORMAT field.                  */
  #define I2S_CONFIG_FORMAT_FORMAT_Min (0x0UL)       /*!< Min enumerator value of FORMAT field.                                */
  #define I2S_CONFIG_FORMAT_FORMAT_Max (0x1UL)       /*!< Max enumerator value of FORMAT field.                                */
  #define I2S_CONFIG_FORMAT_FORMAT_I2S (0x0UL)       /*!< Original I2S format.                                                 */
  #define I2S_CONFIG_FORMAT_FORMAT_Aligned (0x1UL)   /*!< Alternate (left- or right-aligned) format.                           */


/* I2S_CONFIG_CHANNELS: Enable channels */
  #define I2S_CONFIG_CHANNELS_ResetValue (0x00000000UL) /*!< Reset value of CHANNELS register.                                 */

/* CHANNELS @Bits 0..1 : Enable channels */
  #define I2S_CONFIG_CHANNELS_CHANNELS_Pos (0UL)     /*!< Position of CHANNELS field.                                          */
  #define I2S_CONFIG_CHANNELS_CHANNELS_Msk (0x3UL << I2S_CONFIG_CHANNELS_CHANNELS_Pos) /*!< Bit mask of CHANNELS field.        */
  #define I2S_CONFIG_CHANNELS_CHANNELS_Min (0x0UL)   /*!< Min enumerator value of CHANNELS field.                              */
  #define I2S_CONFIG_CHANNELS_CHANNELS_Max (0x2UL)   /*!< Max enumerator value of CHANNELS field.                              */
  #define I2S_CONFIG_CHANNELS_CHANNELS_Stereo (0x0UL) /*!< Stereo.                                                             */
  #define I2S_CONFIG_CHANNELS_CHANNELS_Left (0x1UL)  /*!< Left only.                                                           */
  #define I2S_CONFIG_CHANNELS_CHANNELS_Right (0x2UL) /*!< Right only.                                                          */



/* ===================================================== Struct I2S_RXD ====================================================== */
/**
  * @brief RXD [I2S_RXD] (unspecified)
  */
typedef struct {
  __IOM uint32_t  PTR;                               /*!< (@ 0x00000000) Receive buffer RAM start address.                     */
} NRF_I2S_RXD_Type;                                  /*!< Size = 4 (0x004)                                                     */

/* I2S_RXD_PTR: Receive buffer RAM start address. */
  #define I2S_RXD_PTR_ResetValue (0x20000000UL)      /*!< Reset value of PTR register.                                         */

