NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54l15/nrf54l15_types.h
/* TASKS_PUSHBLOCK @Bit 0 : Block only the PUSH operation of a key slot, preventing the key slot from being PUSHED until next
                            reset. The task is kept for backwards compatibility. */

  #define KMU_TASKS_PUSHBLOCK_TASKS_PUSHBLOCK_Pos (0UL) /*!< Position of TASKS_PUSHBLOCK field.                                */
  #define KMU_TASKS_PUSHBLOCK_TASKS_PUSHBLOCK_Msk (0x1UL << KMU_TASKS_PUSHBLOCK_TASKS_PUSHBLOCK_Pos) /*!< Bit mask of
                                                                            TASKS_PUSHBLOCK field.*/
  #define KMU_TASKS_PUSHBLOCK_TASKS_PUSHBLOCK_Min (0x1UL) /*!< Min enumerator value of TASKS_PUSHBLOCK field.                  */
  #define KMU_TASKS_PUSHBLOCK_TASKS_PUSHBLOCK_Max (0x1UL) /*!< Max enumerator value of TASKS_PUSHBLOCK field.                  */
  #define KMU_TASKS_PUSHBLOCK_TASKS_PUSHBLOCK_Trigger (0x1UL) /*!< Trigger task                                                */


/* KMU_EVENTS_PROVISIONED: Key slot successfully provisioned */
  #define KMU_EVENTS_PROVISIONED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_PROVISIONED register.                    */

/* EVENTS_PROVISIONED @Bit 0 : Key slot successfully provisioned */
  #define KMU_EVENTS_PROVISIONED_EVENTS_PROVISIONED_Pos (0UL) /*!< Position of EVENTS_PROVISIONED field.                       */
  #define KMU_EVENTS_PROVISIONED_EVENTS_PROVISIONED_Msk (0x1UL << KMU_EVENTS_PROVISIONED_EVENTS_PROVISIONED_Pos) /*!< Bit mask
                                                                            of EVENTS_PROVISIONED field.*/
  #define KMU_EVENTS_PROVISIONED_EVENTS_PROVISIONED_Min (0x0UL) /*!< Min enumerator value of EVENTS_PROVISIONED field.         */
  #define KMU_EVENTS_PROVISIONED_EVENTS_PROVISIONED_Max (0x1UL) /*!< Max enumerator value of EVENTS_PROVISIONED field.         */
  #define KMU_EVENTS_PROVISIONED_EVENTS_PROVISIONED_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define KMU_EVENTS_PROVISIONED_EVENTS_PROVISIONED_Generated (0x1UL) /*!< Event generated                                     */


/* KMU_EVENTS_PUSHED: Key slot successfully pushed */
  #define KMU_EVENTS_PUSHED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_PUSHED register.                              */

/* EVENTS_PUSHED @Bit 0 : Key slot successfully pushed */
  #define KMU_EVENTS_PUSHED_EVENTS_PUSHED_Pos (0UL)  /*!< Position of EVENTS_PUSHED field.                                     */
  #define KMU_EVENTS_PUSHED_EVENTS_PUSHED_Msk (0x1UL << KMU_EVENTS_PUSHED_EVENTS_PUSHED_Pos) /*!< Bit mask of EVENTS_PUSHED
                                                                            field.*/
  #define KMU_EVENTS_PUSHED_EVENTS_PUSHED_Min (0x0UL) /*!< Min enumerator value of EVENTS_PUSHED field.                        */
  #define KMU_EVENTS_PUSHED_EVENTS_PUSHED_Max (0x1UL) /*!< Max enumerator value of EVENTS_PUSHED field.                        */
  #define KMU_EVENTS_PUSHED_EVENTS_PUSHED_NotGenerated (0x0UL) /*!< Event not generated                                        */
  #define KMU_EVENTS_PUSHED_EVENTS_PUSHED_Generated (0x1UL) /*!< Event generated                                               */


/* KMU_EVENTS_REVOKED: Key slot has been revoked and can no longer be used */
  #define KMU_EVENTS_REVOKED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_REVOKED register.                            */

/* EVENTS_REVOKED @Bit 0 : Key slot has been revoked and can no longer be used */
  #define KMU_EVENTS_REVOKED_EVENTS_REVOKED_Pos (0UL) /*!< Position of EVENTS_REVOKED field.                                   */
  #define KMU_EVENTS_REVOKED_EVENTS_REVOKED_Msk (0x1UL << KMU_EVENTS_REVOKED_EVENTS_REVOKED_Pos) /*!< Bit mask of EVENTS_REVOKED
                                                                            field.*/
  #define KMU_EVENTS_REVOKED_EVENTS_REVOKED_Min (0x0UL) /*!< Min enumerator value of EVENTS_REVOKED field.                     */
  #define KMU_EVENTS_REVOKED_EVENTS_REVOKED_Max (0x1UL) /*!< Max enumerator value of EVENTS_REVOKED field.                     */
  #define KMU_EVENTS_REVOKED_EVENTS_REVOKED_NotGenerated (0x0UL) /*!< Event not generated                                      */
  #define KMU_EVENTS_REVOKED_EVENTS_REVOKED_Generated (0x1UL) /*!< Event generated                                             */


/* KMU_EVENTS_ERROR: Error generated during PROVISION, PUSH, READMETADATA or REVOKE operations. Triggering the PROVISION, PUSH
                      and REVOKE tasks on a BLOCKED keyslot will also generate this event. */

  #define KMU_EVENTS_ERROR_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_ERROR register.                                */

/* EVENTS_ERROR @Bit 0 : Error generated during PROVISION, PUSH, READMETADATA or REVOKE operations. Triggering the PROVISION,
                         PUSH and REVOKE tasks on a BLOCKED keyslot will also generate this event. */

  #define KMU_EVENTS_ERROR_EVENTS_ERROR_Pos (0UL)    /*!< Position of EVENTS_ERROR field.                                      */
  #define KMU_EVENTS_ERROR_EVENTS_ERROR_Msk (0x1UL << KMU_EVENTS_ERROR_EVENTS_ERROR_Pos) /*!< Bit mask of EVENTS_ERROR field.  */
  #define KMU_EVENTS_ERROR_EVENTS_ERROR_Min (0x0UL)  /*!< Min enumerator value of EVENTS_ERROR field.                          */
  #define KMU_EVENTS_ERROR_EVENTS_ERROR_Max (0x1UL)  /*!< Max enumerator value of EVENTS_ERROR field.                          */
  #define KMU_EVENTS_ERROR_EVENTS_ERROR_NotGenerated (0x0UL) /*!< Event not generated                                          */
  #define KMU_EVENTS_ERROR_EVENTS_ERROR_Generated (0x1UL) /*!< Event generated                                                 */


/* KMU_EVENTS_METADATAREAD: Key slot metadata has been read into METADATA register */
  #define KMU_EVENTS_METADATAREAD_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_METADATAREAD register.                  */

/* EVENTS_METADATAREAD @Bit 0 : Key slot metadata has been read into METADATA register */
  #define KMU_EVENTS_METADATAREAD_EVENTS_METADATAREAD_Pos (0UL) /*!< Position of EVENTS_METADATAREAD field.                    */
  #define KMU_EVENTS_METADATAREAD_EVENTS_METADATAREAD_Msk (0x1UL << KMU_EVENTS_METADATAREAD_EVENTS_METADATAREAD_Pos) /*!< Bit
                                                                            mask of EVENTS_METADATAREAD field.*/
  #define KMU_EVENTS_METADATAREAD_EVENTS_METADATAREAD_Min (0x0UL) /*!< Min enumerator value of EVENTS_METADATAREAD field.      */
  #define KMU_EVENTS_METADATAREAD_EVENTS_METADATAREAD_Max (0x1UL) /*!< Max enumerator value of EVENTS_METADATAREAD field.      */
  #define KMU_EVENTS_METADATAREAD_EVENTS_METADATAREAD_NotGenerated (0x0UL) /*!< Event not generated                            */
  #define KMU_EVENTS_METADATAREAD_EVENTS_METADATAREAD_Generated (0x1UL) /*!< Event generated                                   */


/* KMU_EVENTS_PUSHBLOCKED: The PUSHBLOCK operation was successful. The event is kept for backwards compatibility. */
  #define KMU_EVENTS_PUSHBLOCKED_ResetValue (0x00000000UL) /*!< Reset value of EVENTS_PUSHBLOCKED register.                    */

/* EVENTS_PUSHBLOCKED @Bit 0 : The PUSHBLOCK operation was successful. The event is kept for backwards compatibility. */
  #define KMU_EVENTS_PUSHBLOCKED_EVENTS_PUSHBLOCKED_Pos (0UL) /*!< Position of EVENTS_PUSHBLOCKED field.                       */
  #define KMU_EVENTS_PUSHBLOCKED_EVENTS_PUSHBLOCKED_Msk (0x1UL << KMU_EVENTS_PUSHBLOCKED_EVENTS_PUSHBLOCKED_Pos) /*!< Bit mask
                                                                            of EVENTS_PUSHBLOCKED field.*/
  #define KMU_EVENTS_PUSHBLOCKED_EVENTS_PUSHBLOCKED_Min (0x0UL) /*!< Min enumerator value of EVENTS_PUSHBLOCKED field.         */
  #define KMU_EVENTS_PUSHBLOCKED_EVENTS_PUSHBLOCKED_Max (0x1UL) /*!< Max enumerator value of EVENTS_PUSHBLOCKED field.         */
  #define KMU_EVENTS_PUSHBLOCKED_EVENTS_PUSHBLOCKED_NotGenerated (0x0UL) /*!< Event not generated                              */
  #define KMU_EVENTS_PUSHBLOCKED_EVENTS_PUSHBLOCKED_Generated (0x1UL) /*!< Event generated                                     */


/* KMU_STATUS: KMU status register */
  #define KMU_STATUS_ResetValue (0x00000000UL)       /*!< Reset value of STATUS register.                                      */

/* STATUS @Bit 0 : KMU status */
  #define KMU_STATUS_STATUS_Pos (0UL)                /*!< Position of STATUS field.                                            */
  #define KMU_STATUS_STATUS_Msk (0x1UL << KMU_STATUS_STATUS_Pos) /*!< Bit mask of STATUS field.                                */
  #define KMU_STATUS_STATUS_Min (0x0UL)              /*!< Min enumerator value of STATUS field.                                */
  #define KMU_STATUS_STATUS_Max (0x1UL)              /*!< Max enumerator value of STATUS field.                                */
  #define KMU_STATUS_STATUS_Ready (0x0UL)            /*!< KMU is ready for new operation                                       */
  #define KMU_STATUS_STATUS_Busy (0x1UL)             /*!< KMU is busy, an operation is in progress                             */


/* KMU_KEYSLOT: Select key slot to operate on */
  #define KMU_KEYSLOT_ResetValue (0x00000000UL)      /*!< Reset value of KEYSLOT register.                                     */

/* ID @Bits 0..7 : Select key slot ID to provision, push, read METADATA, revoke or block when the corresponding task is
                   triggered. */

  #define KMU_KEYSLOT_ID_Pos (0UL)                   /*!< Position of ID field.                                                */
  #define KMU_KEYSLOT_ID_Msk (0xFFUL << KMU_KEYSLOT_ID_Pos) /*!< Bit mask of ID field.                                         */
  #define KMU_KEYSLOT_ID_Min (0x00UL)                /*!< Min value of ID field.                                               */
  #define KMU_KEYSLOT_ID_Max (0xF9UL)                /*!< Max size of ID field.                                                */


/* KMU_SRC: Source address for provisioning */
  #define KMU_SRC_ResetValue (0x00000000UL)          /*!< Reset value of SRC register.                                         */

