NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54l15/nrf54l15_types.h
/* RADIO_RSSISAMPLE: RSSI sample */
  #define RADIO_RSSISAMPLE_ResetValue (0x0000007FUL) /*!< Reset value of RSSISAMPLE register.                                  */

/* RSSISAMPLE @Bits 0..6 : RSSI sample result. The value of this register is read as a positive value while the actual received
                           signal strength is a negative value. Actual received signal strength is therefore as follows:
                           received signal strength = -A dBm. */

  #define RADIO_RSSISAMPLE_RSSISAMPLE_Pos (0UL)      /*!< Position of RSSISAMPLE field.                                        */
  #define RADIO_RSSISAMPLE_RSSISAMPLE_Msk (0x7FUL << RADIO_RSSISAMPLE_RSSISAMPLE_Pos) /*!< Bit mask of RSSISAMPLE field.       */


/* RADIO_FREQFINETUNE: Fine tuning of the RF frequency */
  #define RADIO_FREQFINETUNE_ResetValue (0x00000000UL) /*!< Reset value of FREQFINETUNE register.                              */

/* FREQFINETUNE @Bits 0..12 : Twos-complement number for fine-tuning the frequency. The step size is 488.28125 Hz, giving a
                              range from -1 MHz to (one step short of) +1 MHz. */

  #define RADIO_FREQFINETUNE_FREQFINETUNE_Pos (0UL)  /*!< Position of FREQFINETUNE field.                                      */
  #define RADIO_FREQFINETUNE_FREQFINETUNE_Msk (0x1FFFUL << RADIO_FREQFINETUNE_FREQFINETUNE_Pos) /*!< Bit mask of FREQFINETUNE
                                                                            field.*/


/* RADIO_FECONFIG: Config register */
  #define RADIO_FECONFIG_ResetValue (0x10800005UL)   /*!< Reset value of FECONFIG register.                                    */

/* SCALERMODE @Bit 20 : Mode for narrow scaling output. */
  #define RADIO_FECONFIG_SCALERMODE_Pos (20UL)       /*!< Position of SCALERMODE field.                                        */
  #define RADIO_FECONFIG_SCALERMODE_Msk (0x1UL << RADIO_FECONFIG_SCALERMODE_Pos) /*!< Bit mask of SCALERMODE field.            */
  #define RADIO_FECONFIG_SCALERMODE_Min (0x0UL)      /*!< Min enumerator value of SCALERMODE field.                            */
  #define RADIO_FECONFIG_SCALERMODE_Max (0x1UL)      /*!< Max enumerator value of SCALERMODE field.                            */
  #define RADIO_FECONFIG_SCALERMODE_Disabled (0x0UL) /*!< Classic log based scaling mode.                                      */
  #define RADIO_FECONFIG_SCALERMODE_Enabled (0x1UL)  /*!< LUT based scaling mode.                                              */


/* RADIO_CFO_STAT: Carrier freq. offset estimate */
  #define RADIO_CFO_STAT_ResetValue (0x00000000UL)   /*!< Reset value of CFO_STAT register.                                    */

/* SYNCOK @Bit 12 : SYNC ok */
  #define RADIO_CFO_STAT_SYNCOK_Pos (12UL)           /*!< Position of SYNCOK field.                                            */
  #define RADIO_CFO_STAT_SYNCOK_Msk (0x1UL << RADIO_CFO_STAT_SYNCOK_Pos) /*!< Bit mask of SYNCOK field.                        */
  #define RADIO_CFO_STAT_SYNCOK_Min (0x0UL)          /*!< Min enumerator value of SYNCOK field.                                */
  #define RADIO_CFO_STAT_SYNCOK_Max (0x1UL)          /*!< Max enumerator value of SYNCOK field.                                */
  #define RADIO_CFO_STAT_SYNCOK_SyncNotOK (0x0UL)    /*!< (unspecified)                                                        */
  #define RADIO_CFO_STAT_SYNCOK_SyncOk (0x1UL)       /*!< (unspecified)                                                        */


/* RADIO_DBCCORR: Correlator thresholds */
  #define RADIO_DBCCORR_ResetValue (0x1FFFFF90UL)    /*!< Reset value of DBCCORR register.                                     */

/* TH @Bits 0..7 : Correlation threshold */
  #define RADIO_DBCCORR_TH_Pos (0UL)                 /*!< Position of TH field.                                                */
  #define RADIO_DBCCORR_TH_Msk (0xFFUL << RADIO_DBCCORR_TH_Pos) /*!< Bit mask of TH field.                                     */


/* RADIO_DFEMODE: Whether to use Angle-of-Arrival (AOA) or Angle-of-Departure (AOD) */
  #define RADIO_DFEMODE_ResetValue (0x00000000UL)    /*!< Reset value of DFEMODE register.                                     */

/* DFEOPMODE @Bits 0..1 : Direction finding operation mode */
  #define RADIO_DFEMODE_DFEOPMODE_Pos (0UL)          /*!< Position of DFEOPMODE field.                                         */
  #define RADIO_DFEMODE_DFEOPMODE_Msk (0x3UL << RADIO_DFEMODE_DFEOPMODE_Pos) /*!< Bit mask of DFEOPMODE field.                 */
  #define RADIO_DFEMODE_DFEOPMODE_Min (0x0UL)        /*!< Min enumerator value of DFEOPMODE field.                             */
  #define RADIO_DFEMODE_DFEOPMODE_Max (0x3UL)        /*!< Max enumerator value of DFEOPMODE field.                             */
  #define RADIO_DFEMODE_DFEOPMODE_Disabled (0x0UL)   /*!< Direction finding mode disabled                                      */
  #define RADIO_DFEMODE_DFEOPMODE_AoD (0x2UL)        /*!< Direction finding mode set to AoD                                    */
  #define RADIO_DFEMODE_DFEOPMODE_AoA (0x3UL)        /*!< Direction finding mode set to AoA                                    */


/* RADIO_DFESTATUS: DFE status information */
  #define RADIO_DFESTATUS_ResetValue (0x00000000UL)  /*!< Reset value of DFESTATUS register.                                   */

/* SWITCHINGSTATE @Bits 0..2 : Internal state of switching state machine */
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Pos (0UL)   /*!< Position of SWITCHINGSTATE field.                                    */
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Msk (0x7UL << RADIO_DFESTATUS_SWITCHINGSTATE_Pos) /*!< Bit mask of SWITCHINGSTATE
                                                                            field.*/
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Min (0x0UL) /*!< Min enumerator value of SWITCHINGSTATE field.                        */
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Max (0x5UL) /*!< Max enumerator value of SWITCHINGSTATE field.                        */
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Idle (0x0UL) /*!< Switching state Idle                                                */
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Offset (0x1UL) /*!< Switching state Offset                                            */
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Guard (0x2UL) /*!< Switching state Guard                                              */
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Ref (0x3UL) /*!< Switching state Ref                                                  */
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Switching (0x4UL) /*!< Switching state Switching                                      */
  #define RADIO_DFESTATUS_SWITCHINGSTATE_Ending (0x5UL) /*!< Switching state Ending                                            */

/* SAMPLINGSTATE @Bit 4 : Internal state of sampling state machine */
  #define RADIO_DFESTATUS_SAMPLINGSTATE_Pos (4UL)    /*!< Position of SAMPLINGSTATE field.                                     */
  #define RADIO_DFESTATUS_SAMPLINGSTATE_Msk (0x1UL << RADIO_DFESTATUS_SAMPLINGSTATE_Pos) /*!< Bit mask of SAMPLINGSTATE field. */
  #define RADIO_DFESTATUS_SAMPLINGSTATE_Min (0x0UL)  /*!< Min enumerator value of SAMPLINGSTATE field.                         */
  #define RADIO_DFESTATUS_SAMPLINGSTATE_Max (0x1UL)  /*!< Max enumerator value of SAMPLINGSTATE field.                         */
  #define RADIO_DFESTATUS_SAMPLINGSTATE_Idle (0x0UL) /*!< Sampling state Idle                                                  */
  #define RADIO_DFESTATUS_SAMPLINGSTATE_Sampling (0x1UL) /*!< Sampling state Sampling                                          */


