NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54l15/nrf54l15_types.h
/* DOG1 @Bit 2 : Reset from watchdog timer 1 detected */
  #define RESET_RESETREAS_DOG1_Pos (2UL)             /*!< Position of DOG1 field.                                              */
  #define RESET_RESETREAS_DOG1_Msk (0x1UL << RESET_RESETREAS_DOG1_Pos) /*!< Bit mask of DOG1 field.                            */
  #define RESET_RESETREAS_DOG1_Min (0x0UL)           /*!< Min enumerator value of DOG1 field.                                  */
  #define RESET_RESETREAS_DOG1_Max (0x1UL)           /*!< Max enumerator value of DOG1 field.                                  */
  #define RESET_RESETREAS_DOG1_NotDetected (0x0UL)   /*!< Not detected                                                         */
  #define RESET_RESETREAS_DOG1_Detected (0x1UL)      /*!< Detected                                                             */

/* CTRLAPSOFT @Bit 3 : Soft reset from CTRL-AP detected */
  #define RESET_RESETREAS_CTRLAPSOFT_Pos (3UL)       /*!< Position of CTRLAPSOFT field.                                        */
  #define RESET_RESETREAS_CTRLAPSOFT_Msk (0x1UL << RESET_RESETREAS_CTRLAPSOFT_Pos) /*!< Bit mask of CTRLAPSOFT field.          */
  #define RESET_RESETREAS_CTRLAPSOFT_Min (0x0UL)     /*!< Min enumerator value of CTRLAPSOFT field.                            */
  #define RESET_RESETREAS_CTRLAPSOFT_Max (0x1UL)     /*!< Max enumerator value of CTRLAPSOFT field.                            */
  #define RESET_RESETREAS_CTRLAPSOFT_NotDetected (0x0UL) /*!< Not detected                                                     */
  #define RESET_RESETREAS_CTRLAPSOFT_Detected (0x1UL) /*!< Detected                                                            */

/* CTRLAPHARD @Bit 4 : Reset due to CTRL-AP hard reset */
  #define RESET_RESETREAS_CTRLAPHARD_Pos (4UL)       /*!< Position of CTRLAPHARD field.                                        */
  #define RESET_RESETREAS_CTRLAPHARD_Msk (0x1UL << RESET_RESETREAS_CTRLAPHARD_Pos) /*!< Bit mask of CTRLAPHARD field.          */
  #define RESET_RESETREAS_CTRLAPHARD_Min (0x0UL)     /*!< Min enumerator value of CTRLAPHARD field.                            */
  #define RESET_RESETREAS_CTRLAPHARD_Max (0x1UL)     /*!< Max enumerator value of CTRLAPHARD field.                            */
  #define RESET_RESETREAS_CTRLAPHARD_NotDetected (0x0UL) /*!< Not detected                                                     */
  #define RESET_RESETREAS_CTRLAPHARD_Detected (0x1UL) /*!< Detected                                                            */

/* CTRLAPPIN @Bit 5 : Reset due to CTRL-AP pin reset */
  #define RESET_RESETREAS_CTRLAPPIN_Pos (5UL)        /*!< Position of CTRLAPPIN field.                                         */
  #define RESET_RESETREAS_CTRLAPPIN_Msk (0x1UL << RESET_RESETREAS_CTRLAPPIN_Pos) /*!< Bit mask of CTRLAPPIN field.             */
  #define RESET_RESETREAS_CTRLAPPIN_Min (0x0UL)      /*!< Min enumerator value of CTRLAPPIN field.                             */
  #define RESET_RESETREAS_CTRLAPPIN_Max (0x1UL)      /*!< Max enumerator value of CTRLAPPIN field.                             */
  #define RESET_RESETREAS_CTRLAPPIN_NotDetected (0x0UL) /*!< Not detected                                                      */
  #define RESET_RESETREAS_CTRLAPPIN_Detected (0x1UL) /*!< Detected                                                             */

/* SREQ @Bit 6 : Reset from soft reset detected */
  #define RESET_RESETREAS_SREQ_Pos (6UL)             /*!< Position of SREQ field.                                              */
  #define RESET_RESETREAS_SREQ_Msk (0x1UL << RESET_RESETREAS_SREQ_Pos) /*!< Bit mask of SREQ field.                            */
  #define RESET_RESETREAS_SREQ_Min (0x0UL)           /*!< Min enumerator value of SREQ field.                                  */
  #define RESET_RESETREAS_SREQ_Max (0x1UL)           /*!< Max enumerator value of SREQ field.                                  */
  #define RESET_RESETREAS_SREQ_NotDetected (0x0UL)   /*!< Not detected                                                         */
  #define RESET_RESETREAS_SREQ_Detected (0x1UL)      /*!< Detected                                                             */

/* LOCKUP @Bit 7 : Reset from CPU lockup detected */
  #define RESET_RESETREAS_LOCKUP_Pos (7UL)           /*!< Position of LOCKUP field.                                            */
  #define RESET_RESETREAS_LOCKUP_Msk (0x1UL << RESET_RESETREAS_LOCKUP_Pos) /*!< Bit mask of LOCKUP field.                      */
  #define RESET_RESETREAS_LOCKUP_Min (0x0UL)         /*!< Min enumerator value of LOCKUP field.                                */
  #define RESET_RESETREAS_LOCKUP_Max (0x1UL)         /*!< Max enumerator value of LOCKUP field.                                */
  #define RESET_RESETREAS_LOCKUP_NotDetected (0x0UL) /*!< Not detected                                                         */
  #define RESET_RESETREAS_LOCKUP_Detected (0x1UL)    /*!< Detected                                                             */

/* OFF @Bit 8 : Reset due to wakeup from System OFF mode when wakeup is triggered by DETECT signal from GPIO */
  #define RESET_RESETREAS_OFF_Pos (8UL)              /*!< Position of OFF field.                                               */
  #define RESET_RESETREAS_OFF_Msk (0x1UL << RESET_RESETREAS_OFF_Pos) /*!< Bit mask of OFF field.                               */
  #define RESET_RESETREAS_OFF_Min (0x0UL)            /*!< Min enumerator value of OFF field.                                   */
  #define RESET_RESETREAS_OFF_Max (0x1UL)            /*!< Max enumerator value of OFF field.                                   */
  #define RESET_RESETREAS_OFF_NotDetected (0x0UL)    /*!< Not detected                                                         */
  #define RESET_RESETREAS_OFF_Detected (0x1UL)       /*!< Detected                                                             */

/* LPCOMP @Bit 9 : Reset due to wakeup from System OFF mode when wakeup is triggered by ANADETECT signal from LPCOMP */
  #define RESET_RESETREAS_LPCOMP_Pos (9UL)           /*!< Position of LPCOMP field.                                            */
  #define RESET_RESETREAS_LPCOMP_Msk (0x1UL << RESET_RESETREAS_LPCOMP_Pos) /*!< Bit mask of LPCOMP field.                      */
  #define RESET_RESETREAS_LPCOMP_Min (0x0UL)         /*!< Min enumerator value of LPCOMP field.                                */
  #define RESET_RESETREAS_LPCOMP_Max (0x1UL)         /*!< Max enumerator value of LPCOMP field.                                */
  #define RESET_RESETREAS_LPCOMP_NotDetected (0x0UL) /*!< Not detected                                                         */
  #define RESET_RESETREAS_LPCOMP_Detected (0x1UL)    /*!< Detected                                                             */

/* DIF @Bit 10 : Reset triggered by Debug Interface */
  #define RESET_RESETREAS_DIF_Pos (10UL)             /*!< Position of DIF field.                                               */
  #define RESET_RESETREAS_DIF_Msk (0x1UL << RESET_RESETREAS_DIF_Pos) /*!< Bit mask of DIF field.                               */
  #define RESET_RESETREAS_DIF_Min (0x0UL)            /*!< Min enumerator value of DIF field.                                   */
  #define RESET_RESETREAS_DIF_Max (0x1UL)            /*!< Max enumerator value of DIF field.                                   */
  #define RESET_RESETREAS_DIF_NotDetected (0x0UL)    /*!< Not detected                                                         */
  #define RESET_RESETREAS_DIF_Detected (0x1UL)       /*!< Detected                                                             */

