NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54l15/nrf54l15_types.h
/* PRESENT @Bit 31 : Indicates if a peripheral is present with peripheral slave index n */
  #define SPU_PERIPH_PERM_PRESENT_Pos (31UL)         /*!< Position of PRESENT field.                                           */
  #define SPU_PERIPH_PERM_PRESENT_Msk (0x1UL << SPU_PERIPH_PERM_PRESENT_Pos) /*!< Bit mask of PRESENT field.                   */
  #define SPU_PERIPH_PERM_PRESENT_Min (0x0UL)        /*!< Min enumerator value of PRESENT field.                               */
  #define SPU_PERIPH_PERM_PRESENT_Max (0x1UL)        /*!< Max enumerator value of PRESENT field.                               */
  #define SPU_PERIPH_PERM_PRESENT_NotPresent (0x0UL) /*!< Peripheral is not present                                            */
  #define SPU_PERIPH_PERM_PRESENT_IsPresent (0x1UL)  /*!< Peripheral is present                                                */



/* ================================================ Struct SPU_FEATURE_DPPIC ================================================= */
/**
  * @brief DPPIC [SPU_FEATURE_DPPIC] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CH[24];                            /*!< (@ 0x00000000) Security configuration for channel n of DPPIC         */
  __IOM uint32_t  CHG[8];                            /*!< (@ 0x00000060) Security configuration for channel group n of DPPIC   */
} NRF_SPU_FEATURE_DPPIC_Type;                        /*!< Size = 128 (0x080)                                                   */

/* SPU_FEATURE_DPPIC_CH: Security configuration for channel n of DPPIC */
  #define SPU_FEATURE_DPPIC_CH_MaxCount (24UL)       /*!< Max size of CH[24] array.                                            */
  #define SPU_FEATURE_DPPIC_CH_MaxIndex (23UL)       /*!< Max index of CH[24] array.                                           */
  #define SPU_FEATURE_DPPIC_CH_MinIndex (0UL)        /*!< Min index of CH[24] array.                                           */
  #define SPU_FEATURE_DPPIC_CH_ResetValue (0x00100010UL) /*!< Reset value of CH[24] register.                                  */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_DPPIC_CH_SECATTR_Pos (4UL)     /*!< Position of SECATTR field.                                           */
  #define SPU_FEATURE_DPPIC_CH_SECATTR_Msk (0x1UL << SPU_FEATURE_DPPIC_CH_SECATTR_Pos) /*!< Bit mask of SECATTR field.         */
  #define SPU_FEATURE_DPPIC_CH_SECATTR_Min (0x0UL)   /*!< Min enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_DPPIC_CH_SECATTR_Max (0x1UL)   /*!< Max enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_DPPIC_CH_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                        */
  #define SPU_FEATURE_DPPIC_CH_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                                */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_DPPIC_CH_LOCK_Pos (8UL)        /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_DPPIC_CH_LOCK_Msk (0x1UL << SPU_FEATURE_DPPIC_CH_LOCK_Pos) /*!< Bit mask of LOCK field.                  */
  #define SPU_FEATURE_DPPIC_CH_LOCK_Min (0x0UL)      /*!< Min enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_DPPIC_CH_LOCK_Max (0x1UL)      /*!< Max enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_DPPIC_CH_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                                   */
  #define SPU_FEATURE_DPPIC_CH_LOCK_Locked (0x1UL)   /*!< Feature permissions can not be changed until the next reset          */


/* SPU_FEATURE_DPPIC_CHG: Security configuration for channel group n of DPPIC */
  #define SPU_FEATURE_DPPIC_CHG_MaxCount (8UL)       /*!< Max size of CHG[8] array.                                            */
  #define SPU_FEATURE_DPPIC_CHG_MaxIndex (7UL)       /*!< Max index of CHG[8] array.                                           */
  #define SPU_FEATURE_DPPIC_CHG_MinIndex (0UL)       /*!< Min index of CHG[8] array.                                           */
  #define SPU_FEATURE_DPPIC_CHG_ResetValue (0x00100010UL) /*!< Reset value of CHG[8] register.                                 */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_DPPIC_CHG_SECATTR_Pos (4UL)    /*!< Position of SECATTR field.                                           */
  #define SPU_FEATURE_DPPIC_CHG_SECATTR_Msk (0x1UL << SPU_FEATURE_DPPIC_CHG_SECATTR_Pos) /*!< Bit mask of SECATTR field.       */
  #define SPU_FEATURE_DPPIC_CHG_SECATTR_Min (0x0UL)  /*!< Min enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_DPPIC_CHG_SECATTR_Max (0x1UL)  /*!< Max enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_DPPIC_CHG_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                       */
  #define SPU_FEATURE_DPPIC_CHG_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                               */

/* LOCK @Bit 8 : LOCK feature */
  #define SPU_FEATURE_DPPIC_CHG_LOCK_Pos (8UL)       /*!< Position of LOCK field.                                              */
  #define SPU_FEATURE_DPPIC_CHG_LOCK_Msk (0x1UL << SPU_FEATURE_DPPIC_CHG_LOCK_Pos) /*!< Bit mask of LOCK field.                */
  #define SPU_FEATURE_DPPIC_CHG_LOCK_Min (0x0UL)     /*!< Min enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_DPPIC_CHG_LOCK_Max (0x1UL)     /*!< Max enumerator value of LOCK field.                                  */
  #define SPU_FEATURE_DPPIC_CHG_LOCK_Unlocked (0x0UL) /*!< Feature permissions can be updated                                  */
  #define SPU_FEATURE_DPPIC_CHG_LOCK_Locked (0x1UL)  /*!< Feature permissions can not be changed until the next reset          */



/* ================================================ Struct SPU_FEATURE_GPIOTE ================================================ */
/**
  * @brief GPIOTE [SPU_FEATURE_GPIOTE] (unspecified)
  */
typedef struct {
  __IOM uint32_t  CH[8];                             /*!< (@ 0x00000000) Security configuration for channel o of GPIOTE[n]     */
  __IOM uint32_t  INTERRUPT[8];                      /*!< (@ 0x00000020) Security configuration for interrupt o of GPIOTE[n]   */
} NRF_SPU_FEATURE_GPIOTE_Type;                       /*!< Size = 64 (0x040)                                                    */
  #define SPU_FEATURE_GPIOTE_MaxCount (2UL)          /*!< Size of GPIOTE[2] array.                                             */
  #define SPU_FEATURE_GPIOTE_MaxIndex (1UL)          /*!< Max index of GPIOTE[2] array.                                        */
  #define SPU_FEATURE_GPIOTE_MinIndex (0UL)          /*!< Min index of GPIOTE[2] array.                                        */

/* SPU_FEATURE_GPIOTE_CH: Security configuration for channel o of GPIOTE[n] */
  #define SPU_FEATURE_GPIOTE_CH_MaxCount (8UL)       /*!< Max size of CH[8] array.                                             */
  #define SPU_FEATURE_GPIOTE_CH_MaxIndex (7UL)       /*!< Max index of CH[8] array.                                            */
  #define SPU_FEATURE_GPIOTE_CH_MinIndex (0UL)       /*!< Min index of CH[8] array.                                            */
  #define SPU_FEATURE_GPIOTE_CH_ResetValue (0x00100010UL) /*!< Reset value of CH[8] register.                                  */

/* SECATTR @Bit 4 : SECATTR feature */
  #define SPU_FEATURE_GPIOTE_CH_SECATTR_Pos (4UL)    /*!< Position of SECATTR field.                                           */
  #define SPU_FEATURE_GPIOTE_CH_SECATTR_Msk (0x1UL << SPU_FEATURE_GPIOTE_CH_SECATTR_Pos) /*!< Bit mask of SECATTR field.       */
  #define SPU_FEATURE_GPIOTE_CH_SECATTR_Min (0x0UL)  /*!< Min enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_GPIOTE_CH_SECATTR_Max (0x1UL)  /*!< Max enumerator value of SECATTR field.                               */
  #define SPU_FEATURE_GPIOTE_CH_SECATTR_NonSecure (0x0UL) /*!< Feature is available for non-secure usage                       */
  #define SPU_FEATURE_GPIOTE_CH_SECATTR_Secure (0x1UL) /*!< Feature is reserved for secure usage                               */

