NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54l15/nrf54l15_types.h
/* TASKS10 @Bit 10 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS10_Pos (10UL)     /*!< Position of TASKS10 field.                                           */
  #define VPRCSR_NORDIC_TASKS_TASKS10_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS10_Pos) /*!< Bit mask of TASKS10 field.           */
  #define VPRCSR_NORDIC_TASKS_TASKS10_Min (0x0UL)    /*!< Min enumerator value of TASKS10 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS10_Max (0x1UL)    /*!< Max enumerator value of TASKS10 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS10_Disabled (0x0UL) /*!< TASKS[10] diabled                                                  */
  #define VPRCSR_NORDIC_TASKS_TASKS10_Enabled (0x1UL) /*!< TASKS[10] enabled                                                   */

/* TASKS11 @Bit 11 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS11_Pos (11UL)     /*!< Position of TASKS11 field.                                           */
  #define VPRCSR_NORDIC_TASKS_TASKS11_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS11_Pos) /*!< Bit mask of TASKS11 field.           */
  #define VPRCSR_NORDIC_TASKS_TASKS11_Min (0x0UL)    /*!< Min enumerator value of TASKS11 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS11_Max (0x1UL)    /*!< Max enumerator value of TASKS11 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS11_Disabled (0x0UL) /*!< TASKS[11] diabled                                                  */
  #define VPRCSR_NORDIC_TASKS_TASKS11_Enabled (0x1UL) /*!< TASKS[11] enabled                                                   */

/* TASKS12 @Bit 12 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS12_Pos (12UL)     /*!< Position of TASKS12 field.                                           */
  #define VPRCSR_NORDIC_TASKS_TASKS12_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS12_Pos) /*!< Bit mask of TASKS12 field.           */
  #define VPRCSR_NORDIC_TASKS_TASKS12_Min (0x0UL)    /*!< Min enumerator value of TASKS12 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS12_Max (0x1UL)    /*!< Max enumerator value of TASKS12 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS12_Disabled (0x0UL) /*!< TASKS[12] diabled                                                  */
  #define VPRCSR_NORDIC_TASKS_TASKS12_Enabled (0x1UL) /*!< TASKS[12] enabled                                                   */

/* TASKS13 @Bit 13 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS13_Pos (13UL)     /*!< Position of TASKS13 field.                                           */
  #define VPRCSR_NORDIC_TASKS_TASKS13_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS13_Pos) /*!< Bit mask of TASKS13 field.           */
  #define VPRCSR_NORDIC_TASKS_TASKS13_Min (0x0UL)    /*!< Min enumerator value of TASKS13 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS13_Max (0x1UL)    /*!< Max enumerator value of TASKS13 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS13_Disabled (0x0UL) /*!< TASKS[13] diabled                                                  */
  #define VPRCSR_NORDIC_TASKS_TASKS13_Enabled (0x1UL) /*!< TASKS[13] enabled                                                   */

/* TASKS14 @Bit 14 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS14_Pos (14UL)     /*!< Position of TASKS14 field.                                           */
  #define VPRCSR_NORDIC_TASKS_TASKS14_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS14_Pos) /*!< Bit mask of TASKS14 field.           */
  #define VPRCSR_NORDIC_TASKS_TASKS14_Min (0x0UL)    /*!< Min enumerator value of TASKS14 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS14_Max (0x1UL)    /*!< Max enumerator value of TASKS14 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS14_Disabled (0x0UL) /*!< TASKS[14] diabled                                                  */
  #define VPRCSR_NORDIC_TASKS_TASKS14_Enabled (0x1UL) /*!< TASKS[14] enabled                                                   */

/* TASKS15 @Bit 15 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS15_Pos (15UL)     /*!< Position of TASKS15 field.                                           */
  #define VPRCSR_NORDIC_TASKS_TASKS15_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS15_Pos) /*!< Bit mask of TASKS15 field.           */
  #define VPRCSR_NORDIC_TASKS_TASKS15_Min (0x0UL)    /*!< Min enumerator value of TASKS15 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS15_Max (0x1UL)    /*!< Max enumerator value of TASKS15 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS15_Disabled (0x0UL) /*!< TASKS[15] diabled                                                  */
  #define VPRCSR_NORDIC_TASKS_TASKS15_Enabled (0x1UL) /*!< TASKS[15] enabled                                                   */

/* TASKS16 @Bit 16 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS16_Pos (16UL)     /*!< Position of TASKS16 field.                                           */
  #define VPRCSR_NORDIC_TASKS_TASKS16_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS16_Pos) /*!< Bit mask of TASKS16 field.           */
  #define VPRCSR_NORDIC_TASKS_TASKS16_Min (0x0UL)    /*!< Min enumerator value of TASKS16 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS16_Max (0x1UL)    /*!< Max enumerator value of TASKS16 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS16_Disabled (0x0UL) /*!< TASKS[16] diabled                                                  */
  #define VPRCSR_NORDIC_TASKS_TASKS16_Enabled (0x1UL) /*!< TASKS[16] enabled                                                   */

/* TASKS17 @Bit 17 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS17_Pos (17UL)     /*!< Position of TASKS17 field.                                           */
  #define VPRCSR_NORDIC_TASKS_TASKS17_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS17_Pos) /*!< Bit mask of TASKS17 field.           */
  #define VPRCSR_NORDIC_TASKS_TASKS17_Min (0x0UL)    /*!< Min enumerator value of TASKS17 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS17_Max (0x1UL)    /*!< Max enumerator value of TASKS17 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS17_Disabled (0x0UL) /*!< TASKS[17] diabled                                                  */
  #define VPRCSR_NORDIC_TASKS_TASKS17_Enabled (0x1UL) /*!< TASKS[17] enabled                                                   */

/* TASKS18 @Bit 18 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS18_Pos (18UL)     /*!< Position of TASKS18 field.                                           */
  #define VPRCSR_NORDIC_TASKS_TASKS18_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS18_Pos) /*!< Bit mask of TASKS18 field.           */
  #define VPRCSR_NORDIC_TASKS_TASKS18_Min (0x0UL)    /*!< Min enumerator value of TASKS18 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS18_Max (0x1UL)    /*!< Max enumerator value of TASKS18 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS18_Disabled (0x0UL) /*!< TASKS[18] diabled                                                  */
  #define VPRCSR_NORDIC_TASKS_TASKS18_Enabled (0x1UL) /*!< TASKS[18] enabled                                                   */

/* TASKS19 @Bit 19 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS19_Pos (19UL)     /*!< Position of TASKS19 field.                                           */
  #define VPRCSR_NORDIC_TASKS_TASKS19_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS19_Pos) /*!< Bit mask of TASKS19 field.           */
  #define VPRCSR_NORDIC_TASKS_TASKS19_Min (0x0UL)    /*!< Min enumerator value of TASKS19 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS19_Max (0x1UL)    /*!< Max enumerator value of TASKS19 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS19_Disabled (0x0UL) /*!< TASKS[19] diabled                                                  */
  #define VPRCSR_NORDIC_TASKS_TASKS19_Enabled (0x1UL) /*!< TASKS[19] enabled                                                   */

/* TASKS20 @Bit 20 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS20_Pos (20UL)     /*!< Position of TASKS20 field.                                           */
  #define VPRCSR_NORDIC_TASKS_TASKS20_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS20_Pos) /*!< Bit mask of TASKS20 field.           */
  #define VPRCSR_NORDIC_TASKS_TASKS20_Min (0x0UL)    /*!< Min enumerator value of TASKS20 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS20_Max (0x1UL)    /*!< Max enumerator value of TASKS20 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS20_Disabled (0x0UL) /*!< TASKS[20] diabled                                                  */
  #define VPRCSR_NORDIC_TASKS_TASKS20_Enabled (0x1UL) /*!< TASKS[20] enabled                                                   */

