NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54l15/nrf54l15_types.h
/* TASKS21 @Bit 21 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS21_Pos (21UL)     /*!< Position of TASKS21 field.                                           */
  #define VPRCSR_NORDIC_TASKS_TASKS21_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS21_Pos) /*!< Bit mask of TASKS21 field.           */
  #define VPRCSR_NORDIC_TASKS_TASKS21_Min (0x0UL)    /*!< Min enumerator value of TASKS21 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS21_Max (0x1UL)    /*!< Max enumerator value of TASKS21 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS21_Disabled (0x0UL) /*!< TASKS[21] diabled                                                  */
  #define VPRCSR_NORDIC_TASKS_TASKS21_Enabled (0x1UL) /*!< TASKS[21] enabled                                                   */

/* TASKS22 @Bit 22 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS22_Pos (22UL)     /*!< Position of TASKS22 field.                                           */
  #define VPRCSR_NORDIC_TASKS_TASKS22_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS22_Pos) /*!< Bit mask of TASKS22 field.           */
  #define VPRCSR_NORDIC_TASKS_TASKS22_Min (0x0UL)    /*!< Min enumerator value of TASKS22 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS22_Max (0x1UL)    /*!< Max enumerator value of TASKS22 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS22_Disabled (0x0UL) /*!< TASKS[22] diabled                                                  */
  #define VPRCSR_NORDIC_TASKS_TASKS22_Enabled (0x1UL) /*!< TASKS[22] enabled                                                   */

/* TASKS23 @Bit 23 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS23_Pos (23UL)     /*!< Position of TASKS23 field.                                           */
  #define VPRCSR_NORDIC_TASKS_TASKS23_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS23_Pos) /*!< Bit mask of TASKS23 field.           */
  #define VPRCSR_NORDIC_TASKS_TASKS23_Min (0x0UL)    /*!< Min enumerator value of TASKS23 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS23_Max (0x1UL)    /*!< Max enumerator value of TASKS23 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS23_Disabled (0x0UL) /*!< TASKS[23] diabled                                                  */
  #define VPRCSR_NORDIC_TASKS_TASKS23_Enabled (0x1UL) /*!< TASKS[23] enabled                                                   */

/* TASKS24 @Bit 24 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS24_Pos (24UL)     /*!< Position of TASKS24 field.                                           */
  #define VPRCSR_NORDIC_TASKS_TASKS24_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS24_Pos) /*!< Bit mask of TASKS24 field.           */
  #define VPRCSR_NORDIC_TASKS_TASKS24_Min (0x0UL)    /*!< Min enumerator value of TASKS24 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS24_Max (0x1UL)    /*!< Max enumerator value of TASKS24 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS24_Disabled (0x0UL) /*!< TASKS[24] diabled                                                  */
  #define VPRCSR_NORDIC_TASKS_TASKS24_Enabled (0x1UL) /*!< TASKS[24] enabled                                                   */

/* TASKS25 @Bit 25 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS25_Pos (25UL)     /*!< Position of TASKS25 field.                                           */
  #define VPRCSR_NORDIC_TASKS_TASKS25_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS25_Pos) /*!< Bit mask of TASKS25 field.           */
  #define VPRCSR_NORDIC_TASKS_TASKS25_Min (0x0UL)    /*!< Min enumerator value of TASKS25 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS25_Max (0x1UL)    /*!< Max enumerator value of TASKS25 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS25_Disabled (0x0UL) /*!< TASKS[25] diabled                                                  */
  #define VPRCSR_NORDIC_TASKS_TASKS25_Enabled (0x1UL) /*!< TASKS[25] enabled                                                   */

/* TASKS26 @Bit 26 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS26_Pos (26UL)     /*!< Position of TASKS26 field.                                           */
  #define VPRCSR_NORDIC_TASKS_TASKS26_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS26_Pos) /*!< Bit mask of TASKS26 field.           */
  #define VPRCSR_NORDIC_TASKS_TASKS26_Min (0x0UL)    /*!< Min enumerator value of TASKS26 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS26_Max (0x1UL)    /*!< Max enumerator value of TASKS26 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS26_Disabled (0x0UL) /*!< TASKS[26] diabled                                                  */
  #define VPRCSR_NORDIC_TASKS_TASKS26_Enabled (0x1UL) /*!< TASKS[26] enabled                                                   */

/* TASKS27 @Bit 27 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS27_Pos (27UL)     /*!< Position of TASKS27 field.                                           */
  #define VPRCSR_NORDIC_TASKS_TASKS27_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS27_Pos) /*!< Bit mask of TASKS27 field.           */
  #define VPRCSR_NORDIC_TASKS_TASKS27_Min (0x0UL)    /*!< Min enumerator value of TASKS27 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS27_Max (0x1UL)    /*!< Max enumerator value of TASKS27 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS27_Disabled (0x0UL) /*!< TASKS[27] diabled                                                  */
  #define VPRCSR_NORDIC_TASKS_TASKS27_Enabled (0x1UL) /*!< TASKS[27] enabled                                                   */

/* TASKS28 @Bit 28 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS28_Pos (28UL)     /*!< Position of TASKS28 field.                                           */
  #define VPRCSR_NORDIC_TASKS_TASKS28_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS28_Pos) /*!< Bit mask of TASKS28 field.           */
  #define VPRCSR_NORDIC_TASKS_TASKS28_Min (0x0UL)    /*!< Min enumerator value of TASKS28 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS28_Max (0x1UL)    /*!< Max enumerator value of TASKS28 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS28_Disabled (0x0UL) /*!< TASKS[28] diabled                                                  */
  #define VPRCSR_NORDIC_TASKS_TASKS28_Enabled (0x1UL) /*!< TASKS[28] enabled                                                   */

/* TASKS29 @Bit 29 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS29_Pos (29UL)     /*!< Position of TASKS29 field.                                           */
  #define VPRCSR_NORDIC_TASKS_TASKS29_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS29_Pos) /*!< Bit mask of TASKS29 field.           */
  #define VPRCSR_NORDIC_TASKS_TASKS29_Min (0x0UL)    /*!< Min enumerator value of TASKS29 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS29_Max (0x1UL)    /*!< Max enumerator value of TASKS29 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS29_Disabled (0x0UL) /*!< TASKS[29] diabled                                                  */
  #define VPRCSR_NORDIC_TASKS_TASKS29_Enabled (0x1UL) /*!< TASKS[29] enabled                                                   */

/* TASKS30 @Bit 30 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS30_Pos (30UL)     /*!< Position of TASKS30 field.                                           */
  #define VPRCSR_NORDIC_TASKS_TASKS30_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS30_Pos) /*!< Bit mask of TASKS30 field.           */
  #define VPRCSR_NORDIC_TASKS_TASKS30_Min (0x0UL)    /*!< Min enumerator value of TASKS30 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS30_Max (0x1UL)    /*!< Max enumerator value of TASKS30 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS30_Disabled (0x0UL) /*!< TASKS[30] diabled                                                  */
  #define VPRCSR_NORDIC_TASKS_TASKS30_Enabled (0x1UL) /*!< TASKS[30] enabled                                                   */

/* TASKS31 @Bit 31 : (unspecified) */
  #define VPRCSR_NORDIC_TASKS_TASKS31_Pos (31UL)     /*!< Position of TASKS31 field.                                           */
  #define VPRCSR_NORDIC_TASKS_TASKS31_Msk (0x1UL << VPRCSR_NORDIC_TASKS_TASKS31_Pos) /*!< Bit mask of TASKS31 field.           */
  #define VPRCSR_NORDIC_TASKS_TASKS31_Min (0x0UL)    /*!< Min enumerator value of TASKS31 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS31_Max (0x1UL)    /*!< Max enumerator value of TASKS31 field.                               */
  #define VPRCSR_NORDIC_TASKS_TASKS31_Disabled (0x0UL) /*!< TASKS[31] diabled                                                  */
  #define VPRCSR_NORDIC_TASKS_TASKS31_Enabled (0x1UL) /*!< TASKS[31] enabled                                                   */


/**
  * @brief SUBSCRIBE [VPRCSR_NORDIC_SUBSCRIBE] Enable Task Subscription
  */
  #define VPRCSR_NORDIC_SUBSCRIBE (0x000007E1ul)
  #define VPRCSR_NORDIC_SUBSCRIBE_ResetValue (0x00000000UL) /*!< Reset value of SUBSCRIBE register.                            */

/* SUBSCRIBE16 @Bit 16 : (unspecified) */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE16_Pos (16UL) /*!< Position of SUBSCRIBE16 field.                                   */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE16_Msk (0x1UL << VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE16_Pos) /*!< Bit mask of
                                                                            SUBSCRIBE16 field.*/
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE16_Min (0x0UL) /*!< Min enumerator value of SUBSCRIBE16 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE16_Max (0x1UL) /*!< Max enumerator value of SUBSCRIBE16 field.                      */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE16_Disabled (0x0UL) /*!< Subscribe disabled for TASK[16]                            */
  #define VPRCSR_NORDIC_SUBSCRIBE_SUBSCRIBE16_Enabled (0x1UL) /*!< Subscribe enabled for TASK[16]                              */

