NordicSemiconductor/nrfx/bsp/stable/mdk/nrf54l/nrf54l15/nrf54l15_types.h
/* PIN26 @Bit 26 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN26_Pos (26UL)        /*!< Position of PIN26 field.                                             */
  #define VPRCSR_NORDIC_OUTB_PIN26_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN26_Pos) /*!< Bit mask of PIN26 field.                   */
  #define VPRCSR_NORDIC_OUTB_PIN26_Min (0x0UL)       /*!< Min enumerator value of PIN26 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN26_Max (0x1UL)       /*!< Max enumerator value of PIN26 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN26_LOW (0x0UL)       /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUTB_PIN26_HIGH (0x1UL)      /*!< Pin driver is high                                                   */

/* PIN27 @Bit 27 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN27_Pos (27UL)        /*!< Position of PIN27 field.                                             */
  #define VPRCSR_NORDIC_OUTB_PIN27_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN27_Pos) /*!< Bit mask of PIN27 field.                   */
  #define VPRCSR_NORDIC_OUTB_PIN27_Min (0x0UL)       /*!< Min enumerator value of PIN27 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN27_Max (0x1UL)       /*!< Max enumerator value of PIN27 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN27_LOW (0x0UL)       /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUTB_PIN27_HIGH (0x1UL)      /*!< Pin driver is high                                                   */

/* PIN28 @Bit 28 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN28_Pos (28UL)        /*!< Position of PIN28 field.                                             */
  #define VPRCSR_NORDIC_OUTB_PIN28_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN28_Pos) /*!< Bit mask of PIN28 field.                   */
  #define VPRCSR_NORDIC_OUTB_PIN28_Min (0x0UL)       /*!< Min enumerator value of PIN28 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN28_Max (0x1UL)       /*!< Max enumerator value of PIN28 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN28_LOW (0x0UL)       /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUTB_PIN28_HIGH (0x1UL)      /*!< Pin driver is high                                                   */

/* PIN29 @Bit 29 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN29_Pos (29UL)        /*!< Position of PIN29 field.                                             */
  #define VPRCSR_NORDIC_OUTB_PIN29_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN29_Pos) /*!< Bit mask of PIN29 field.                   */
  #define VPRCSR_NORDIC_OUTB_PIN29_Min (0x0UL)       /*!< Min enumerator value of PIN29 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN29_Max (0x1UL)       /*!< Max enumerator value of PIN29 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN29_LOW (0x0UL)       /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUTB_PIN29_HIGH (0x1UL)      /*!< Pin driver is high                                                   */

/* PIN30 @Bit 30 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN30_Pos (30UL)        /*!< Position of PIN30 field.                                             */
  #define VPRCSR_NORDIC_OUTB_PIN30_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN30_Pos) /*!< Bit mask of PIN30 field.                   */
  #define VPRCSR_NORDIC_OUTB_PIN30_Min (0x0UL)       /*!< Min enumerator value of PIN30 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN30_Max (0x1UL)       /*!< Max enumerator value of PIN30 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN30_LOW (0x0UL)       /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUTB_PIN30_HIGH (0x1UL)      /*!< Pin driver is high                                                   */

/* PIN31 @Bit 31 : (unspecified) */
  #define VPRCSR_NORDIC_OUTB_PIN31_Pos (31UL)        /*!< Position of PIN31 field.                                             */
  #define VPRCSR_NORDIC_OUTB_PIN31_Msk (0x1UL << VPRCSR_NORDIC_OUTB_PIN31_Pos) /*!< Bit mask of PIN31 field.                   */
  #define VPRCSR_NORDIC_OUTB_PIN31_Min (0x0UL)       /*!< Min enumerator value of PIN31 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN31_Max (0x1UL)       /*!< Max enumerator value of PIN31 field.                                 */
  #define VPRCSR_NORDIC_OUTB_PIN31_LOW (0x0UL)       /*!< Pin driver is low                                                    */
  #define VPRCSR_NORDIC_OUTB_PIN31_HIGH (0x1UL)      /*!< Pin driver is high                                                   */


/**
  * @brief DIRB [VPRCSR_NORDIC_DIRB] Buffered GPIO pin Direction
  */
  #define VPRCSR_NORDIC_DIRB (0x00000BC5ul)
  #define VPRCSR_NORDIC_DIRB_ResetValue (0x00000000UL) /*!< Reset value of DIRB register.                                      */

/* PIN0 @Bit 0 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN0_Pos (0UL)          /*!< Position of PIN0 field.                                              */
  #define VPRCSR_NORDIC_DIRB_PIN0_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN0_Pos) /*!< Bit mask of PIN0 field.                      */
  #define VPRCSR_NORDIC_DIRB_PIN0_Min (0x0UL)        /*!< Min enumerator value of PIN0 field.                                  */
  #define VPRCSR_NORDIC_DIRB_PIN0_Max (0x1UL)        /*!< Max enumerator value of PIN0 field.                                  */
  #define VPRCSR_NORDIC_DIRB_PIN0_INPUT (0x0UL)      /*!< Pin is set as input                                                  */
  #define VPRCSR_NORDIC_DIRB_PIN0_OUTPUT (0x1UL)     /*!< Pin is set as output                                                 */

/* PIN1 @Bit 1 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN1_Pos (1UL)          /*!< Position of PIN1 field.                                              */
  #define VPRCSR_NORDIC_DIRB_PIN1_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN1_Pos) /*!< Bit mask of PIN1 field.                      */
  #define VPRCSR_NORDIC_DIRB_PIN1_Min (0x0UL)        /*!< Min enumerator value of PIN1 field.                                  */
  #define VPRCSR_NORDIC_DIRB_PIN1_Max (0x1UL)        /*!< Max enumerator value of PIN1 field.                                  */
  #define VPRCSR_NORDIC_DIRB_PIN1_INPUT (0x0UL)      /*!< Pin is set as input                                                  */
  #define VPRCSR_NORDIC_DIRB_PIN1_OUTPUT (0x1UL)     /*!< Pin is set as output                                                 */

/* PIN2 @Bit 2 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN2_Pos (2UL)          /*!< Position of PIN2 field.                                              */
  #define VPRCSR_NORDIC_DIRB_PIN2_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN2_Pos) /*!< Bit mask of PIN2 field.                      */
  #define VPRCSR_NORDIC_DIRB_PIN2_Min (0x0UL)        /*!< Min enumerator value of PIN2 field.                                  */
  #define VPRCSR_NORDIC_DIRB_PIN2_Max (0x1UL)        /*!< Max enumerator value of PIN2 field.                                  */
  #define VPRCSR_NORDIC_DIRB_PIN2_INPUT (0x0UL)      /*!< Pin is set as input                                                  */
  #define VPRCSR_NORDIC_DIRB_PIN2_OUTPUT (0x1UL)     /*!< Pin is set as output                                                 */

/* PIN3 @Bit 3 : (unspecified) */
  #define VPRCSR_NORDIC_DIRB_PIN3_Pos (3UL)          /*!< Position of PIN3 field.                                              */
  #define VPRCSR_NORDIC_DIRB_PIN3_Msk (0x1UL << VPRCSR_NORDIC_DIRB_PIN3_Pos) /*!< Bit mask of PIN3 field.                      */
  #define VPRCSR_NORDIC_DIRB_PIN3_Min (0x0UL)        /*!< Min enumerator value of PIN3 field.                                  */
  #define VPRCSR_NORDIC_DIRB_PIN3_Max (0x1UL)        /*!< Max enumerator value of PIN3 field.                                  */
  #define VPRCSR_NORDIC_DIRB_PIN3_INPUT (0x0UL)      /*!< Pin is set as input                                                  */
  #define VPRCSR_NORDIC_DIRB_PIN3_OUTPUT (0x1UL)     /*!< Pin is set as output                                                 */

